
*** Dumping AST Record Layout
   0 | _RuneRange
   0 |   int __nranges
   4 |   _RuneEntry * __ranges
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
   0 | _RuneLocale
   0 |   char [8] __magic
   8 |   char [32] __encoding
  40 |   __rune_t (*)(const char *, __size_t, const char **) __sgetrune
  44 |   int (*)(__rune_t, char *, __size_t, char **) __sputrune
  48 |   __rune_t __invalid_rune
  52 |   unsigned long [256] __runetype
1076 |   __rune_t [256] __maplower
2100 |   __rune_t [256] __mapupper
3124 |   _RuneRange __runetype_ext
3124 |     int __nranges
3128 |     _RuneEntry * __ranges
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]
3132 |   _RuneRange __maplower_ext
3132 |     int __nranges
3136 |     _RuneEntry * __ranges
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]
3140 |   _RuneRange __mapupper_ext
3140 |     int __nranges
3144 |     _RuneEntry * __ranges
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]
3148 |   void * __variable
3152 |   int __variable_len
     | [sizeof=3156, dsize=3156, align=4
     |  nvsize=3156, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::piecewise_construct_t (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::allocator_arg_t (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | class std::__1::tuple<> (empty)
     | [sizeof=1, dsize=0, align=1
     |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
   0 |   size_type __cap_
   4 |   size_type __size_
   8 |   pointer __data_
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9)
   0 |   unsigned char __size_
   0 |   value_type __lx
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
   0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |     unsigned char __size_
   0 |     value_type __lx
     |   [sizeof=1, dsize=1, align=1
     |    nvsize=1, nvalign=1]
   1 |   value_type [11] __data_
     | [sizeof=12, dsize=12, align=1
     |  nvsize=12, nvalign=1]

*** Dumping AST Record Layout
   0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
   0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
   0 |     size_type __cap_
   4 |     size_type __size_
   8 |     pointer __data_
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
   0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
   0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |       unsigned char __size_
   0 |       value_type __lx
     |     [sizeof=1, dsize=1, align=1
     |      nvsize=1, nvalign=1]
   1 |     value_type [11] __data_
     |   [sizeof=12, dsize=12, align=1
     |    nvsize=12, nvalign=1]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
   0 |   char __lx
   1 |   char __lxx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
   0 |   size_type __cap_
   4 |   size_type __size_
   8 |   pointer __data_
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9)
   0 |   unsigned char __size_
   0 |   value_type __lx
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
   0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |     unsigned char __size_
   0 |     value_type __lx
     |   [sizeof=4, dsize=4, align=4
     |    nvsize=4, nvalign=4]
   4 |   value_type [2] __data_
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
   0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
   0 |     size_type __cap_
   4 |     size_type __size_
   8 |     pointer __data_
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
   0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
   0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |       unsigned char __size_
   0 |       value_type __lx
     |     [sizeof=4, dsize=4, align=4
     |      nvsize=4, nvalign=4]
   4 |     value_type [2] __data_
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::mutex
   0 |   pthread_mutex_t __m_
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::defer_lock_t (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::try_to_lock_t (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::adopt_lock_t (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | class std::__1::condition_variable
   0 |   pthread_cond_t __cv_
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
   0 |   rep __rep_
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
   0 |   rep __rep_
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000> >
   0 |   rep __rep_
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::__two
   0 |   char [2] __lx
     | [sizeof=2, dsize=2, align=1
     |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::__struct_double
   0 |   long double __lx
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::__struct_double4
   0 |   double [4] __lx
     | [sizeof=32, dsize=32, align=4
     |  nvsize=32, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::aligned_storage<12, 8>::type
   0 |   unsigned char [12] __lx
     | [sizeof=16, dsize=16, align=8
     |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
   0 | struct (anonymous at /usr/include/c++/v1/functional:2364:13)
   0 |   size_t __a
   4 |   size_t __b
   8 |   size_t __c
  12 |   size_t __d
     | [sizeof=16, dsize=16, align=4
     |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
   0 | union (anonymous at /usr/include/c++/v1/functional:2361:9)
   0 |   long double __t
   0 |   struct (anonymous at /usr/include/c++/v1/functional:2364:13) 
   0 |     size_t __a
   4 |     size_t __b
   8 |     size_t __c
  12 |     size_t __d
     |   [sizeof=16, dsize=16, align=4
     |    nvsize=16, nvalign=4]
     | [sizeof=16, dsize=16, align=4
     |  nvsize=16, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::once_flag
   0 |   unsigned long __state_
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::locale::id
   0 |   struct std::__1::once_flag __flag_
   0 |     unsigned long __state_
     |   [sizeof=4, dsize=4, align=4
     |    nvsize=4, nvalign=4]
   4 |   int32_t __id_
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::__basic_string_common<true> (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | class std::__1::allocator<char> (empty)
     | [sizeof=1, dsize=0, align=1
     |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
   0 |   size_type [3] __words
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9)
   0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
   0 |     size_type __cap_
   4 |     size_type __size_
   8 |     pointer __data_
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
   0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
   0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |       unsigned char __size_
   0 |       value_type __lx
     |     [sizeof=1, dsize=1, align=1
     |      nvsize=1, nvalign=1]
   1 |     value_type [11] __data_
     |   [sizeof=12, dsize=12, align=1
     |    nvsize=12, nvalign=1]
   0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
   0 |     size_type [3] __words
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
   0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
   0 |       size_type __cap_
   4 |       size_type __size_
   8 |       pointer __data_
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
   0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
   0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |         unsigned char __size_
   0 |         value_type __lx
     |       [sizeof=1, dsize=1, align=1
     |        nvsize=1, nvalign=1]
   1 |       value_type [11] __data_
     |     [sizeof=12, dsize=12, align=1
     |      nvsize=12, nvalign=1]
   0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
   0 |       size_type [3] __words
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
   0 |   class std::__1::allocator<char> (base) (empty)
   0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
   0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
   0 |         size_type __cap_
   4 |         size_type __size_
   8 |         pointer __data_
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
   0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
   0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |           unsigned char __size_
   0 |           value_type __lx
     |         [sizeof=1, dsize=1, align=1
     |          nvsize=1, nvalign=1]
   1 |         value_type [11] __data_
     |       [sizeof=12, dsize=12, align=1
     |        nvsize=12, nvalign=1]
   0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
   0 |         size_type [3] __words
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
   0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
   0 |     class std::__1::allocator<char> (base) (empty)
   0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
   0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
   0 |           size_type __cap_
   4 |           size_type __size_
   8 |           pointer __data_
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
   0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
   0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |             unsigned char __size_
   0 |             value_type __lx
     |           [sizeof=1, dsize=1, align=1
     |            nvsize=1, nvalign=1]
   1 |           value_type [11] __data_
     |         [sizeof=12, dsize=12, align=1
     |          nvsize=12, nvalign=1]
   0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
   0 |           size_type [3] __words
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::basic_string<char>
   0 |   class std::__1::__basic_string_common<true> (base) (empty)
   0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
   0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
   0 |       class std::__1::allocator<char> (base) (empty)
   0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
   0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
   0 |             size_type __cap_
   4 |             size_type __size_
   8 |             pointer __data_
     |           [sizeof=12, dsize=12, align=4
     |            nvsize=12, nvalign=4]
   0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
   0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |               unsigned char __size_
   0 |               value_type __lx
     |             [sizeof=1, dsize=1, align=1
     |              nvsize=1, nvalign=1]
   1 |             value_type [11] __data_
     |           [sizeof=12, dsize=12, align=1
     |            nvsize=12, nvalign=1]
   0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
   0 |             size_type [3] __words
     |           [sizeof=12, dsize=12, align=4
     |            nvsize=12, nvalign=4]
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::allocator<wchar_t> (empty)
     | [sizeof=1, dsize=0, align=1
     |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
   0 |   size_type [3] __words
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9)
   0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
   0 |     size_type __cap_
   4 |     size_type __size_
   8 |     pointer __data_
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
   0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
   0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |       unsigned char __size_
   0 |       value_type __lx
     |     [sizeof=4, dsize=4, align=4
     |      nvsize=4, nvalign=4]
   4 |     value_type [2] __data_
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
   0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
   0 |     size_type [3] __words
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
   0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
   0 |       size_type __cap_
   4 |       size_type __size_
   8 |       pointer __data_
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
   0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
   0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |         unsigned char __size_
   0 |         value_type __lx
     |       [sizeof=4, dsize=4, align=4
     |        nvsize=4, nvalign=4]
   4 |       value_type [2] __data_
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
   0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
   0 |       size_type [3] __words
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
   0 |   class std::__1::allocator<wchar_t> (base) (empty)
   0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
   0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
   0 |         size_type __cap_
   4 |         size_type __size_
   8 |         pointer __data_
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
   0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
   0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |           unsigned char __size_
   0 |           value_type __lx
     |         [sizeof=4, dsize=4, align=4
     |          nvsize=4, nvalign=4]
   4 |         value_type [2] __data_
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
   0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
   0 |         size_type [3] __words
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
   0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
   0 |     class std::__1::allocator<wchar_t> (base) (empty)
   0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
   0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
   0 |           size_type __cap_
   4 |           size_type __size_
   8 |           pointer __data_
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
   0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
   0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |             unsigned char __size_
   0 |             value_type __lx
     |           [sizeof=4, dsize=4, align=4
     |            nvsize=4, nvalign=4]
   4 |           value_type [2] __data_
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
   0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
   0 |           size_type [3] __words
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
     |     [sizeof=12, dsize=12, align=4
     |      nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::basic_string<wchar_t>
   0 |   class std::__1::__basic_string_common<true> (base) (empty)
   0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
   0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
   0 |       class std::__1::allocator<wchar_t> (base) (empty)
   0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
   0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/include/c++/v1/string:1310:9) 
   0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
   0 |             size_type __cap_
   4 |             size_type __size_
   8 |             pointer __data_
     |           [sizeof=12, dsize=12, align=4
     |            nvsize=12, nvalign=4]
   0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
   0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/include/c++/v1/string:1289:9) 
   0 |               unsigned char __size_
   0 |               value_type __lx
     |             [sizeof=4, dsize=4, align=4
     |              nvsize=4, nvalign=4]
   4 |             value_type [2] __data_
     |           [sizeof=12, dsize=12, align=4
     |            nvsize=12, nvalign=4]
   0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
   0 |             size_type [3] __words
     |           [sizeof=12, dsize=12, align=4
     |            nvsize=12, nvalign=4]
     |         [sizeof=12, dsize=12, align=4
     |          nvsize=12, nvalign=4]
     |       [sizeof=12, dsize=12, align=4
     |        nvsize=12, nvalign=4]
     |   [sizeof=12, dsize=12, align=4
     |    nvsize=12, nvalign=4]
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::money_base::pattern
   0 |   char [4] field
     | [sizeof=4, dsize=4, align=1
     |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
   0 | class std::__1::__bitset<0, 0> (empty)
     | [sizeof=1, dsize=0, align=1
     |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
   0 | class std::__1::ios_base
   0 |   (ios_base vtable pointer)
   4 |   fmtflags __fmtflags_
   8 |   streamsize __precision_
  12 |   streamsize __width_
  16 |   iostate __rdstate_
  20 |   iostate __exceptions_
  24 |   void * __rdbuf_
  28 |   void * __loc_
  32 |   event_callback * __fn_
  36 |   int * __index_
  40 |   size_t __event_size_
  44 |   size_t __event_cap_
  48 |   long * __iarray_
  52 |   size_t __iarray_size_
  56 |   size_t __iarray_cap_
  60 |   void ** __parray_
  64 |   size_t __parray_size_
  68 |   size_t __parray_cap_
     | [sizeof=72, dsize=72, align=4
     |  nvsize=72, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::basic_ios<char>
   0 |   class std::__1::ios_base (primary base)
   0 |     (ios_base vtable pointer)
   4 |     fmtflags __fmtflags_
   8 |     streamsize __precision_
  12 |     streamsize __width_
  16 |     iostate __rdstate_
  20 |     iostate __exceptions_
  24 |     void * __rdbuf_
  28 |     void * __loc_
  32 |     event_callback * __fn_
  36 |     int * __index_
  40 |     size_t __event_size_
  44 |     size_t __event_cap_
  48 |     long * __iarray_
  52 |     size_t __iarray_size_
  56 |     size_t __iarray_cap_
  60 |     void ** __parray_
  64 |     size_t __parray_size_
  68 |     size_t __parray_cap_
  72 |   basic_ostream<char_type, traits_type> * __tie_
  76 |   int_type __fill_
     | [sizeof=80, dsize=80, align=4
     |  nvsize=80, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::basic_ostream<char>
   0 |   (basic_ostream vtable pointer)
   4 |   class std::__1::basic_ios<char> (virtual base)
   4 |     class std::__1::ios_base (primary base)
   4 |       (ios_base vtable pointer)
   8 |       fmtflags __fmtflags_
  12 |       streamsize __precision_
  16 |       streamsize __width_
  20 |       iostate __rdstate_
  24 |       iostate __exceptions_
  28 |       void * __rdbuf_
  32 |       void * __loc_
  36 |       event_callback * __fn_
  40 |       int * __index_
  44 |       size_t __event_size_
  48 |       size_t __event_cap_
  52 |       long * __iarray_
  56 |       size_t __iarray_size_
  60 |       size_t __iarray_cap_
  64 |       void ** __parray_
  68 |       size_t __parray_size_
  72 |       size_t __parray_cap_
  76 |     basic_ostream<char_type, traits_type> * __tie_
  80 |     int_type __fill_
     | [sizeof=84, dsize=84, align=4
     |  nvsize=4, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x2c054f60 prev 0x2b93acd0 </usr/include/c++/v1/ios:231:1, line:381:1> line:231:56 referenced class ios_base definition
|-TypeVisibilityAttr 0x2c054fb0 <col:23, col:52> Default
|-CXXRecordDecl 0x2c055030 <col:1, col:56> col:56 implicit referenced class ios_base
|-AccessSpecDecl 0x2c055080 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x2c0550c0 <line:234:5, col:60> col:60 class failure
| `-TypeVisibilityAttr 0x2c055120 <col:27, col:56> Default
|-TypedefDecl 0x2c055160 <line:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
|-VarDecl 0x2c0551b0 <line:237:5, col:39> col:27 referenced boolalpha 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0551f8 <col:39> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0551e0 <col:39> 'int' 1
|-VarDecl 0x2c055250 <line:238:5, col:33> col:27 referenced dec 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055298 <col:33> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055280 <col:33> 'int' 2
|-VarDecl 0x2c0552f0 <line:239:5, col:35> col:27 referenced fixed 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055338 <col:35> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055320 <col:35> 'int' 4
|-VarDecl 0x2c055390 <line:240:5, col:33> col:27 referenced hex 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0553d8 <col:33> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0553c0 <col:33> 'int' 8
|-VarDecl 0x2c055430 <line:241:5, col:38> col:27 referenced internal 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055478 <col:38> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055460 <col:38> 'int' 16
|-VarDecl 0x2c0554d0 <line:242:5, col:34> col:27 referenced left 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055518 <col:34> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055500 <col:34> 'int' 32
|-VarDecl 0x2c055570 <line:243:5, col:33> col:27 referenced oct 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0555b8 <col:33> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0555a0 <col:33> 'int' 64
|-VarDecl 0x2c055610 <line:244:5, col:35> col:27 referenced right 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055658 <col:35> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055640 <col:35> 'int' 128
|-VarDecl 0x2c0556b0 <line:245:5, col:40> col:27 referenced scientific 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0556f8 <col:40> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0556e0 <col:40> 'int' 256
|-VarDecl 0x2c055750 <line:246:5, col:38> col:27 referenced showbase 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055798 <col:38> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055780 <col:38> 'int' 512
|-VarDecl 0x2c0557f0 <line:247:5, col:39> col:27 referenced showpoint 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055838 <col:39> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055820 <col:39> 'int' 1024
|-VarDecl 0x2c055890 <line:248:5, col:37> col:27 referenced showpos 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0558d8 <col:37> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0558c0 <col:37> 'int' 2048
|-VarDecl 0x2c055930 <line:249:5, col:36> col:27 referenced skipws 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055978 <col:36> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055960 <col:36> 'int' 4096
|-VarDecl 0x2c0559d0 <line:250:5, col:37> col:27 referenced unitbuf 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055a18 <col:37> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055a00 <col:37> 'int' 8192
|-VarDecl 0x2c055a70 <line:251:5, col:39> col:27 referenced uppercase 'const fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055ab8 <col:39> 'const fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055aa0 <col:39> 'int' 16384
|-VarDecl 0x2c055b10 <line:252:5, col:56> col:27 referenced adjustfield 'const fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x2c055bd0 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x2c055b90 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x2c055b70 <col:41> 'fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x2c055b40 <col:41> 'const fmtflags':'const unsigned int' lvalue Var 0x2c0554d0 'left' 'const fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x2c055b80 <col:48> 'fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x2c055b58 <col:48> 'const fmtflags':'const unsigned int' lvalue Var 0x2c055610 'right' 'const fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x2c055bc0 <col:56> 'fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x2c055ba8 <col:56> 'const fmtflags':'const unsigned int' lvalue Var 0x2c055430 'internal' 'const fmtflags':'const unsigned int'
|-VarDecl 0x2c055c30 <line:253:5, col:51> col:27 referenced basefield 'const fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x2c055cf0 <col:39, col:51> 'unsigned int' '|'
|   |-BinaryOperator 0x2c055cb0 <col:39, col:45> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x2c055c90 <col:39> 'fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x2c055c60 <col:39> 'const fmtflags':'const unsigned int' lvalue Var 0x2c055250 'dec' 'const fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x2c055ca0 <col:45> 'fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x2c055c78 <col:45> 'const fmtflags':'const unsigned int' lvalue Var 0x2c055570 'oct' 'const fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x2c055ce0 <col:51> 'fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x2c055cc8 <col:51> 'const fmtflags':'const unsigned int' lvalue Var 0x2c055390 'hex' 'const fmtflags':'const unsigned int'
|-VarDecl 0x2c055d50 <line:254:5, col:53> col:27 referenced floatfield 'const fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x2c055dd0 <col:40, col:53> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x2c055db0 <col:40> 'fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x2c055d80 <col:40> 'const fmtflags':'const unsigned int' lvalue Var 0x2c0556b0 'scientific' 'const fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x2c055dc0 <col:53> 'fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x2c055d98 <col:53> 'const fmtflags':'const unsigned int' lvalue Var 0x2c0552f0 'fixed' 'const fmtflags':'const unsigned int'
|-TypedefDecl 0x2c055e30 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
|-TypedefDecl 0x2c055e80 <line:257:5, col:21> col:21 io_state 'iostate':'unsigned int'
|-VarDecl 0x2c055eb0 <line:258:5, col:35> col:26 referenced badbit 'const iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055ef8 <col:35> 'const iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055ee0 <col:35> 'int' 1
|-VarDecl 0x2c055f50 <line:259:5, col:35> col:26 referenced eofbit 'const iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c055f98 <col:35> 'const iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c055f80 <col:35> 'int' 2
|-VarDecl 0x2c055ff0 <line:260:5, col:36> col:26 referenced failbit 'const iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c056038 <col:36> 'const iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c056020 <col:36> 'int' 4
|-VarDecl 0x2c056090 <line:261:5, col:36> col:26 referenced goodbit 'const iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0560d8 <col:36> 'const iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0560c0 <col:36> 'int' 0
|-TypedefDecl 0x2c056130 <line:263:5, col:26> col:26 referenced openmode 'unsigned int'
|-TypedefDecl 0x2c056180 <line:264:5, col:22> col:22 open_mode 'openmode':'unsigned int'
|-VarDecl 0x2c0561b0 <line:265:5, col:33> col:27 app 'const openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0561f8 <col:33> 'const openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0561e0 <col:33> 'int' 1
|-VarDecl 0x2c056250 <line:266:5, col:33> col:27 ate 'const openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c056298 <col:33> 'const openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c056280 <col:33> 'int' 2
|-VarDecl 0x2c0562f0 <line:267:5, col:36> col:27 binary 'const openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c056338 <col:36> 'const openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c056320 <col:36> 'int' 4
|-VarDecl 0x2c056390 <line:268:5, col:32> col:27 referenced in 'const openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c0563d8 <col:32> 'const openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c0563c0 <col:32> 'int' 8
|-VarDecl 0x2c056430 <line:269:5, col:33> col:27 referenced out 'const openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c056478 <col:33> 'const openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c056460 <col:33> 'int' 16
|-VarDecl 0x2c0564d0 <line:270:5, col:35> col:27 trunc 'const openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x2c056518 <col:35> 'const openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x2c056500 <col:35> 'int' 32
|-EnumDecl 0x2c056560 <line:272:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x2c0565c0 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x2c0565f0 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x2c056620 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x2c056660 <line:273:5, col:21> col:21 seek_dir 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x2c056700 <line:275:5, col:33> col:33 streamoff 'std::__1::streamoff':'long long'
|-TypedefDecl 0x2c056780 <line:276:5, col:33> col:33 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
|-CXXRecordDecl 0x2c0567d0 <line:278:5, col:60> col:60 class Init
| `-TypeVisibilityAttr 0x2c056830 <col:27, col:56> Default
|-CXXMethodDecl 0x2c0568d0 <line:281:5, col:84> col:76 flags 'fmtflags (void) const'
| |-AlwaysInlineAttr 0x2c056930 <col:47> always_inline
| `-VisibilityAttr 0x2c056960 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c056a30 <line:282:5, col:98> col:76 flags 'fmtflags (fmtflags)'
| |-ParmVarDecl 0x2c0569a0 <col:82, col:91> col:91 __fmtfl 'fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x2c056aa0 <col:47> always_inline
| `-VisibilityAttr 0x2c056ad0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c056b60 <line:283:5, col:97> col:76 setf 'fmtflags (fmtflags)'
| |-ParmVarDecl 0x2c056b10 <col:81, col:90> col:90 __fmtfl 'fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x2c056bd0 <col:47> always_inline
| `-VisibilityAttr 0x2c056c00 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c056cf0 <line:284:5, col:114> col:76 setf 'fmtflags (fmtflags, fmtflags)'
| |-ParmVarDecl 0x2c056c40 <col:81, col:90> col:90 __fmtfl 'fmtflags':'unsigned int'
| |-ParmVarDecl 0x2c056c80 <col:99, col:108> col:108 __mask 'fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x2c056d60 <col:47> always_inline
| `-VisibilityAttr 0x2c056d90 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c056e40 <line:285:5, col:94> col:72 unsetf 'void (fmtflags)'
| |-ParmVarDecl 0x2c056dd0 <col:79, col:88> col:88 __mask 'fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x2c056eb0 <col:47> always_inline
| `-VisibilityAttr 0x2c056ee0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c056f60 <line:287:5, col:90> col:78 precision 'streamsize (void) const'
| |-AlwaysInlineAttr 0x2c056fc0 <col:47> always_inline
| `-VisibilityAttr 0x2c057000 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c0570b0 <line:288:5, col:105> col:78 precision 'streamsize (streamsize)'
| |-ParmVarDecl 0x2c057040 <col:88, col:99> col:99 __prec 'streamsize':'int'
| |-AlwaysInlineAttr 0x2c057120 <col:47> always_inline
| `-VisibilityAttr 0x2c057150 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c0571a0 <line:289:5, col:86> col:78 width 'streamsize (void) const'
| |-AlwaysInlineAttr 0x2c057200 <col:47> always_inline
| `-VisibilityAttr 0x2c057230 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c0572c0 <line:290:5, col:101> col:78 width 'streamsize (streamsize)'
| |-ParmVarDecl 0x2c057270 <col:84, col:95> col:95 __wide 'streamsize':'int'
| |-AlwaysInlineAttr 0x2c057330 <col:47> always_inline
| `-VisibilityAttr 0x2c057360 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c0573e0 <line:293:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x2c057390 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x2c057480 <line:294:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x2c057500 <line:297:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x2c0575f0 <line:298:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x2c057570 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x2c0576f0 <line:299:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x2c057670 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x2c057790 <line:302:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x2c057800 <line:305:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x2c057860 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x2c057890 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x2c0578c0 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x2c057a70 <line:306:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|-CXXMethodDecl 0x2c057b90 <line:307:5, col:60> col:10 register_callback 'void (event_callback, int)'
| |-ParmVarDecl 0x2c057ac0 <col:28, col:43> col:43 __fn 'event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x2c057b00 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x2c057c00 <line:309:1, col:8> col:1 private
|-CXXConstructorDecl 0x2c057cd0 <line:310:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x2c057c50 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x2c057dd0 <line:311:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x2c057d60 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x2c057e40 <line:313:1, col:7> col:1 public
|-CXXMethodDecl 0x2c057ed0 <line:314:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x2c057e60 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x2c059750 <col:47> '_Bool' true
|-CXXMethodDecl 0x2c057f90 <line:316:5, col:85> col:75 rdstate 'iostate (void) const'
| |-AlwaysInlineAttr 0x2c057ff0 <col:47> always_inline
| `-VisibilityAttr 0x2c058020 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c0580b0 <line:317:5, col:41> col:10 used clear 'void (iostate)'
| `-ParmVarDecl 0x2c058040 <col:16, col:34> col:24 __state 'iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x2c059778 <col:34> 'iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x2c059760 <col:34> 'const iostate':'const unsigned int' lvalue Var 0x2c056090 'goodbit' 'const iostate':'const unsigned int'
|-CXXMethodDecl 0x2c058190 <line:318:5, col:96> col:72 setstate 'void (iostate)'
| |-ParmVarDecl 0x2c058140 <col:81, col:89> col:89 __state 'iostate':'unsigned int'
| |-AlwaysInlineAttr 0x2c058200 <col:47> always_inline
| `-VisibilityAttr 0x2c058230 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058280 <line:320:5, col:79> col:72 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x2c0582e0 <col:47> always_inline
| `-VisibilityAttr 0x2c058310 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058360 <line:321:5, col:78> col:72 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x2c0583c0 <col:47> always_inline
| `-VisibilityAttr 0x2c0583f0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058440 <line:322:5, col:79> col:72 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x2c0584a0 <col:47> always_inline
| `-VisibilityAttr 0x2c0584d0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058520 <line:323:5, col:78> col:72 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x2c058580 <col:47> always_inline
| `-VisibilityAttr 0x2c0585b0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058600 <line:325:5, col:88> col:75 exceptions 'iostate (void) const'
| |-AlwaysInlineAttr 0x2c058660 <col:47> always_inline
| `-VisibilityAttr 0x2c058690 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058720 <line:326:5, col:100> col:72 exceptions 'void (iostate)'
| |-ParmVarDecl 0x2c0586d0 <col:83, col:91> col:91 __iostate 'iostate':'unsigned int'
| |-AlwaysInlineAttr 0x2c058790 <col:47> always_inline
| `-VisibilityAttr 0x2c0587c0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c0587f0 <line:328:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x2c058870 <line:329:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x2c0588d0 <line:331:1, col:10> col:1 protected
|-CXXConstructorDecl 0x2c058930 <line:332:5, line:334:16> line:333:5 ios_base 'void (void)'
| |-CompoundStmt 0x2c059788 <col:16, line:334:16>
| |-AlwaysInlineAttr 0x2c0589a0 <line:332:47> always_inline
| `-VisibilityAttr 0x2c0589d0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058a50 <line:336:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x2c058a00 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x2c058b20 <line:337:5, col:104> col:73 rdbuf 'void *(void) const'
| |-CompoundStmt 0x2c0597e8 <col:87, col:104>
| | `-ReturnStmt 0x2c0597d8 <col:88, col:95>
| |   `-ImplicitCastExpr 0x2c0597c8 <col:95> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x2c0597a8 <col:95> 'void *const' lvalue ->__rdbuf_ 0x2c059340
| |       `-CXXThisExpr 0x2c059798 <col:95> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x2c058b80 <col:47> always_inline
| `-VisibilityAttr 0x2c058bb0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058c50 <line:339:5, line:344:5> line:340:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x2c058c00 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x2c0598d8 <line:341:5, line:344:5>
| | |-BinaryOperator 0x2c059858 <line:342:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x2c059810 <col:9> 'void *' lvalue ->__rdbuf_ 0x2c059340
| | | | `-CXXThisExpr 0x2c059800 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x2c059848 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x2c059830 <col:20> 'void *' lvalue ParmVar 0x2c058c00 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x2c0598a0 <line:343:9, col:15> 'void'
| |   |-MemberExpr 0x2c059880 <col:9> '<bound member function type>' ->clear 0x2c0580b0
| |   | `-CXXThisExpr 0x2c059870 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x2c0598c8 <<invalid sloc>> 'iostate':'unsigned int'
| |-AlwaysInlineAttr 0x2c058cc0 <line:339:47> always_inline
| `-VisibilityAttr 0x2c058cf0 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2c058d80 <line:346:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x2c058d10 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x2c058e50 <line:347:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x2c058e00 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x2c058f40 <line:348:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x2c058ed0 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x2c059030 <line:349:5, col:26> col:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x2c058fc0 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x2c059120 <line:351:5, line:355:5> line:352:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x2c0590d0 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x2c059960 <line:353:5, line:355:5>
| | `-BinaryOperator 0x2c059948 <line:354:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x2c059900 <col:9> 'void *' lvalue ->__rdbuf_ 0x2c059340
| |   | `-CXXThisExpr 0x2c0598f0 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x2c059938 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x2c059920 <col:20> 'void *' lvalue ParmVar 0x2c0590d0 '__sb' 'void *'
| |-AlwaysInlineAttr 0x2c059190 <line:351:47> always_inline
| `-VisibilityAttr 0x2c0591c0 <col:21, col:44> Hidden
|-AccessSpecDecl 0x2c0591e0 <line:357:1, col:8> col:1 private
|-FieldDecl 0x2c059200 <line:359:5, col:14> col:14 referenced __fmtflags_ 'fmtflags':'unsigned int'
|-FieldDecl 0x2c059240 <line:360:5, col:16> col:16 referenced __precision_ 'streamsize':'int'
|-FieldDecl 0x2c059280 <line:361:5, col:16> col:16 referenced __width_ 'streamsize':'int'
|-FieldDecl 0x2c0592c0 <line:362:5, col:13> col:13 referenced __rdstate_ 'iostate':'unsigned int'
|-FieldDecl 0x2c059300 <line:363:5, col:13> col:13 referenced __exceptions_ 'iostate':'unsigned int'
|-FieldDecl 0x2c059340 <line:364:5, col:11> col:11 referenced __rdbuf_ 'void *'
|-FieldDecl 0x2c059380 <line:365:5, col:11> col:11 __loc_ 'void *'
|-FieldDecl 0x2c059400 <line:366:5, col:21> col:21 __fn_ 'event_callback *'
|-FieldDecl 0x2c059440 <line:367:5, col:10> col:10 __index_ 'int *'
|-FieldDecl 0x2c059480 <line:368:5, col:12> col:12 __event_size_ 'size_t':'unsigned int'
|-FieldDecl 0x2c0594c0 <line:369:5, col:12> col:12 __event_cap_ 'size_t':'unsigned int'
|-VarDecl 0x2c059580 <line:371:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x2c0595c0 <line:375:5, col:11> col:11 __iarray_ 'long *'
|-FieldDecl 0x2c059600 <line:376:5, col:12> col:12 __iarray_size_ 'size_t':'unsigned int'
|-FieldDecl 0x2c059640 <line:377:5, col:12> col:12 __iarray_cap_ 'size_t':'unsigned int'
|-FieldDecl 0x2c059680 <line:378:5, col:12> col:12 __parray_ 'void **'
|-FieldDecl 0x2c0596c0 <line:379:5, col:12> col:12 __parray_size_ 'size_t':'unsigned int'
`-FieldDecl 0x2c059700 <line:380:5, col:12> col:12 __parray_cap_ 'size_t':'unsigned int'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i32, i32, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i32, i32, i32*, i32, i32, i8**, i32, i32 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i32, i32, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i32, i32, i32*, i32, i32, i8**, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2b93ebe0 parent 0x2b93ac40 </usr/include/c++/v1/streambuf:559:1, col:86> col:72 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TypeVisibilityAttr 0x2c097410 <col:39, col:68> Default
|-CXXRecordDecl 0x2c0974d0 prev 0x2b93ebe0 </usr/include/c++/v1/ios:571:1, col:56> col:56 implicit class basic_ios
|-AccessSpecDecl 0x2c097520 <line:574:1, col:7> col:1 public
|-TypedefDecl 0x2c097560 <line:576:5, col:20> col:20 char_type 'char':'char'
|-TypedefDecl 0x2c0975b0 <line:577:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|-TypedefDecl 0x2c097640 <line:579:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
|-TypedefDecl 0x2c0976b0 <line:580:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
|-TypedefDecl 0x2c097720 <line:581:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
|-CXXConversionDecl 0x2c097750 <line:583:5, line:585:47> col:9 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x2c0977f0 <line:583:47> always_inline
|-CXXMethodDecl 0x2c097820 <line:586:5, col:105> col:72 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x2c097890 <col:47> always_inline
|-CXXMethodDecl 0x2c0978c0 <line:587:5, col:119> col:75 rdstate 'iostate (void) const'
| `-AlwaysInlineAttr 0x2c097930 <col:47> always_inline
|-CXXMethodDecl 0x2c0979b0 <line:588:5, col:131> col:72 clear 'void (iostate)'
| |-ParmVarDecl 0x2c097960 <col:78, col:96> col:86 __state 'iostate':'unsigned int'
| `-AlwaysInlineAttr 0x2c097a20 <col:47> always_inline
|-CXXMethodDecl 0x2c097a80 <line:589:5, col:127> col:72 setstate 'void (iostate)'
| |-ParmVarDecl 0x2c097a50 <col:81, col:89> col:89 __state 'iostate':'unsigned int'
| `-AlwaysInlineAttr 0x2c097af0 <col:47> always_inline
|-CXXMethodDecl 0x2c097b20 <line:590:5, col:110> col:72 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x2c097b90 <col:47> always_inline
|-CXXMethodDecl 0x2c097bc0 <line:591:5, col:108> col:72 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x2c097c30 <col:47> always_inline
|-CXXMethodDecl 0x2c097c60 <line:592:5, col:110> col:72 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x2c097cd0 <col:47> always_inline
|-CXXMethodDecl 0x2c097d00 <line:593:5, col:108> col:72 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x2c097d70 <col:47> always_inline
|-CXXMethodDecl 0x2c097da0 <line:595:5, col:125> col:75 exceptions 'iostate (void) const'
| `-AlwaysInlineAttr 0x2c097e10 <col:47> always_inline
|-CXXMethodDecl 0x2c097e70 <line:596:5, col:135> col:72 exceptions 'void (iostate)'
| |-ParmVarDecl 0x2c097e40 <col:83, col:91> col:91 __iostate 'iostate':'unsigned int'
| `-AlwaysInlineAttr 0x2c097ee0 <col:47> always_inline
|-CXXConstructorDecl 0x2c098070 <line:599:5, line:600:14> col:14 basic_ios 'void (basic_streambuf<char_type, traits_type> *)'
| |-ParmVarDecl 0x2c097fc0 <col:24, col:64> col:64 __sb 'basic_streambuf<char_type, traits_type> *'
| `-AlwaysInlineAttr 0x2c0980f0 <line:652:50> always_inline
|-CXXDestructorDecl 0x2c098130 <line:601:5, col:14> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x2c0982c0 <line:604:5, line:605:50> col:44 tie 'basic_ostream<char_type, traits_type> *(void) const'
| `-AlwaysInlineAttr 0x2c098330 <line:674:50> always_inline
|-CXXMethodDecl 0x2c098530 <line:606:5, line:607:95> col:44 tie 'basic_ostream<char_type, traits_type> *(basic_ostream<char_type, traits_type> *)'
| |-ParmVarDecl 0x2c098470 <col:48, col:87> col:87 __tiestr 'basic_ostream<char_type, traits_type> *'
| `-AlwaysInlineAttr 0x2c0985a0 <line:682:50> always_inline
|-CXXMethodDecl 0x2c0986c0 <line:609:5, line:610:54> col:46 rdbuf 'basic_streambuf<char_type, traits_type> *(void) const'
| `-AlwaysInlineAttr 0x2c098730 <line:692:50> always_inline
|-CXXMethodDecl 0x2c098930 <line:611:5, line:612:97> col:46 rdbuf 'basic_streambuf<char_type, traits_type> *(basic_streambuf<char_type, traits_type> *)'
| |-ParmVarDecl 0x2c098870 <col:52, col:93> col:93 __sb 'basic_streambuf<char_type, traits_type> *'
| `-AlwaysInlineAttr 0x2c0989a0 <line:700:50> always_inline
|-CXXMethodDecl 0x2c098a90 <line:614:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x2c098a20 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x2c098b30 <line:616:5, line:617:22> col:15 fill 'char_type (void) const'
| `-AlwaysInlineAttr 0x2c098ba0 <line:738:50> always_inline
|-CXXMethodDecl 0x2c098c60 <line:618:5, line:619:34> col:15 fill 'char_type (char_type)'
| |-ParmVarDecl 0x2c098bd0 <col:20, col:30> col:30 __ch 'char_type':'char'
| `-AlwaysInlineAttr 0x2c098cd0 <line:748:50> always_inline
|-CXXMethodDecl 0x2c098d30 <line:621:5, line:622:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x2c098d00 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x2c098da0 <line:710:50> always_inline
|-CXXMethodDecl 0x2c098e70 <line:624:5, line:625:47> col:10 narrow 'char (char_type, char) const'
| |-ParmVarDecl 0x2c098dd0 <col:17, col:27> col:27 __c 'char_type':'char'
| |-ParmVarDecl 0x2c098e00 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x2c098ee0 <line:722:50> always_inline
|-CXXMethodDecl 0x2c098f80 <line:626:5, line:627:31> col:15 widen 'char_type (char) const'
| |-ParmVarDecl 0x2c098f10 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x2c098ff0 <line:730:50> always_inline
|-AccessSpecDecl 0x2c099020 <line:629:1, col:10> col:1 protected
|-CXXConstructorDecl 0x2c099050 <line:630:5, line:631:5> col:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x2c0990d0 <line:630:47> always_inline
|-CXXMethodDecl 0x2c099210 <line:633:5, line:634:60> col:10 init 'void (basic_streambuf<char_type, traits_type> *)'
| |-ParmVarDecl 0x2c0991a0 <col:15, col:56> col:56 __sb 'basic_streambuf<char_type, traits_type> *'
| `-AlwaysInlineAttr 0x2c099280 <line:664:50> always_inline
|-CXXMethodDecl 0x2c099330 <line:636:5, line:637:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x2c0992c0 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x2c0993a0 <line:774:50> always_inline
|-CXXMethodDecl 0x2c099470 <line:639:5, line:640:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x2c099400 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x2c0994e0 <line:639:47> always_inline
|-CXXMethodDecl 0x2c099590 <line:642:5, line:643:33> col:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x2c099520 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x2c099600 <line:785:50> always_inline
|-CXXMethodDecl 0x2c099740 <line:644:5, line:645:65> col:10 set_rdbuf 'void (basic_streambuf<char_type, traits_type> *)'
| |-ParmVarDecl 0x2c0996d0 <col:20, col:61> col:61 __sb 'basic_streambuf<char_type, traits_type> *'
| `-AlwaysInlineAttr 0x2c0997b0 <line:795:50> always_inline
|-AccessSpecDecl 0x2c0997e0 <line:646:1, col:8> col:1 private
|-FieldDecl 0x2c0998a0 <line:647:5, col:44> col:44 __tie_ 'basic_ostream<char_type, traits_type> *'
|-FieldDecl 0x2c0998f0 <line:648:6, col:23> col:23 __fill_ 'int_type':'int' mutable
|-CXXConstructorDecl 0x2c099940 </usr/include/c++/v1/streambuf:559:72> col:72 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline noexcept-unevaluated 0x2c099940
| `-ParmVarDecl 0x2c0999f0 <col:72> col:72 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x2c099a30 <col:72, <invalid sloc>> col:72 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline noexcept-unevaluated 0x2c099a30
  `-ParmVarDecl 0x2c099ab0 <col:72> col:72 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type { %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios" = type { %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2b8e1420 parent 0x2b93ac40 </usr/include/c++/v1/ostream:1108:1, col:90> col:72 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TypeVisibilityAttr 0x2c2b6ad0 <col:39, col:68> Default
|-CXXRecordDecl 0x2c2b6c70 prev 0x2b8e1420 <line:151:1, col:56> col:56 implicit class basic_ostream
|-AccessSpecDecl 0x2c2b6cc0 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x2c2b6ce0 <line:156:5, col:20> col:20 char_type 'char':'char'
|-TypedefDecl 0x2c2b6d10 <line:157:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|-TypedefDecl 0x2c2b6da0 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
|-TypedefDecl 0x2c2b6e10 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
|-TypedefDecl 0x2c2b6e80 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
|-CXXConstructorDecl 0x2c2b6ff0 <line:163:5, col:14> col:14 basic_ostream 'void (basic_streambuf<char_type, traits_type> *)'
| |-ParmVarDecl 0x2c2b6f60 <col:28, col:69> col:69 __sb 'basic_streambuf<char_type, traits_type> *'
| `-AlwaysInlineAttr 0x2c2b7070 <line:278:50> always_inline
|-CXXDestructorDecl 0x2c2b70b0 <line:164:5, col:14> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x2c2b7130 <line:165:1, col:10> col:1 protected
|-CXXConstructorDecl 0x2c2b7200 <line:167:5, line:168:5> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)'
| |-ParmVarDecl 0x2c2b7180 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x2c2b7280 <line:287:50> always_inline
|-CXXMethodDecl 0x2c2b7350 <line:173:5, line:174:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)'
| |-ParmVarDecl 0x2c2b72e0 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x2c2b73c0 <line:294:50> always_inline
|-CXXMethodDecl 0x2c2b7470 <line:176:5, col:35> col:10 swap 'void (class std::__1::basic_ostream<char> &)'
| |-ParmVarDecl 0x2c2b7400 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x2c2b74e0 <line:310:50> always_inline
|-CXXConstructorDecl 0x2c2b75c0 <line:179:5> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x2c2b7540 <col:20, col:41> col:41 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x2c2b76c0 <line:180:5, col:56> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x2c2b7650 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x2c2b7730 <line:185:1, col:7> col:1 public
|-CXXRecordDecl 0x2c2b7750 <line:188:5, col:60> col:60 class sentry definition
| |-CXXRecordDecl 0x2c2b93b0 prev 0x2c2b7750 <line:226:1, col:88> col:88 implicit class sentry
| |-FieldDecl 0x2c2b9400 <line:228:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x2c2b9500 <line:229:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x2c2b95f0 <line:231:5> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x2c2b9560 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x2c2b9710 <line:232:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x2c2b96a0 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x2c2b9780 <line:234:1, col:7> col:1 public
| |-CXXConstructorDecl 0x2c2b98c0 <line:235:5, col:14> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x2c2b9840 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x2c2b9960 <line:236:5, col:6> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x2c2b9960
| `-CXXConversionDecl 0x2c2b99e0 <line:238:5, line:240:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x2c2b9a80 <line:238:47> always_inline
|-CXXMethodDecl 0x2c2b7940 <line:191:5, col:69> col:20 used operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))'
| |-ParmVarDecl 0x2c2b78b0 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x2c2b79b0 <line:318:50> always_inline
|-CXXMethodDecl 0x2c2b7ca0 <line:192:5, line:193:73> line:192:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<char_type, traits_type> &(*)(basic_ios<char_type, traits_type> &))'
| |-ParmVarDecl 0x2c2b7c10 <col:31, line:193:72> col:33 __pf 'basic_ios<char_type, traits_type> &(*)(basic_ios<char_type, traits_type> &)'
| `-AlwaysInlineAttr 0x2c2b7d10 <line:326:50> always_inline
|-CXXMethodDecl 0x2c2b7dd0 <line:194:5, col:59> col:20 used operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))'
| |-ParmVarDecl 0x2c2b7d40 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x2c2b7e40 <line:336:50> always_inline
|-CXXMethodDecl 0x2c2b7ee0 <line:195:5, col:39> col:20 used operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x2c2b7e70 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x2c2b7fc0 <line:196:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x2c2b7f50 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x2c2b80a0 <line:197:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x2c2b8030 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x2c2b8180 <line:198:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x2c2b8110 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x2c2b8260 <line:199:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x2c2b81f0 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x2c2b8340 <line:200:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x2c2b82d0 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x2c2b8420 <line:201:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x2c2b83b0 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x2c2b8500 <line:202:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x2c2b8490 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x2c2b85e0 <line:203:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x2c2b8570 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x2c2b86c0 <line:204:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x2c2b8650 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x2c2b87a0 <line:205:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x2c2b8730 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x2c2b8880 <line:206:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x2c2b8810 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x2c2b8960 <line:207:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x2c2b88f0 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x2c2b8b00 <line:208:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<char_type, traits_type> *)'
| `-ParmVarDecl 0x2c2b8a70 <col:31, col:72> col:72 __sb 'basic_streambuf<char_type, traits_type> *'
|-CXXMethodDecl 0x2c2b8c10 <line:211:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(char_type)'
| `-ParmVarDecl 0x2c2b8b80 <col:24, col:34> col:34 __c 'char_type':'char'
|-CXXMethodDecl 0x2c2b8d80 <line:212:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const char_type *, streamsize)'
| |-ParmVarDecl 0x2c2b8cb0 <col:26, col:43> col:43 __s 'const char_type *'
| `-ParmVarDecl 0x2c2b8ce0 <col:48, col:59> col:59 __n 'streamsize':'int'
|-CXXMethodDecl 0x2c2b8e30 <line:213:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x2c2b8f00 <line:216:5, col:20> col:14 tellp 'pos_type (void)'
| `-AlwaysInlineAttr 0x2c2b8f70 <line:992:50> always_inline
|-CXXMethodDecl 0x2c2b9030 <line:217:5, col:40> col:20 seekp 'class std::__1::basic_ostream<char> &(pos_type)'
| |-ParmVarDecl 0x2c2b8fa0 <col:26, col:35> col:35 __pos 'pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x2c2b90a0 <line:1002:50> always_inline
|-CXXMethodDecl 0x2c2b91c0 <line:218:5, col:65> col:20 seekp 'class std::__1::basic_ostream<char> &(off_type, class ios_base::seekdir)'
| |-ParmVarDecl 0x2c2b90f0 <col:26, col:35> col:35 __off 'off_type':'long long'
| |-ParmVarDecl 0x2c2b9120 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x2c2b9230 <line:1016:50> always_inline
|-AccessSpecDecl 0x2c2b9260 <line:220:1, col:10> col:1 protected
`-CXXConstructorDecl 0x2c2b9290 <line:221:5, line:222:5> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x2c2b9310 <line:221:47> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | struct data::tuple<> (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | struct data::tuple<const char *>
   0 |   struct data::tuple<> (base) (empty)
   0 |   const char * tail
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | struct data::tuple<unsigned long long, const char *>
   0 |   struct data::tuple<const char *> (base)
   0 |     struct data::tuple<> (base) (empty)
   0 |     const char * tail
   4 |   unsigned long long tail
     | [sizeof=12, dsize=12, align=4
     |  nvsize=12, nvalign=4]

*** Dumping AST Record Layout
   0 | struct data::tuple<double, unsigned long long, const char *>
   0 |   struct data::tuple<unsigned long long, const char *> (base)
   0 |     struct data::tuple<const char *> (base)
   0 |       struct data::tuple<> (base) (empty)
   0 |       const char * tail
   4 |     unsigned long long tail
  12 |   double tail
     | [sizeof=20, dsize=20, align=4
     |  nvsize=20, nvalign=4]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c313d30 <./include/tuple.hpp:8:3, line:9:17> col:10 struct tuple definition
|-TemplateArgument pack
|-CXXRecordDecl 0x2c313e50 prev 0x2c313d30 <col:3, col:10> col:10 implicit struct tuple
|-CXXConstructorDecl 0x2c3145f0 <col:10> col:10 implicit constexpr tuple 'void (const struct data::tuple<> &)' inline noexcept-unevaluated 0x2c3145f0
| `-ParmVarDecl 0x2c3146a0 <col:10> col:10 'const struct data::tuple<> &'
|-CXXConstructorDecl 0x2c314700 <col:10> col:10 implicit constexpr tuple 'void (struct data::tuple<> &&)' inline noexcept-unevaluated 0x2c314700
| `-ParmVarDecl 0x2c3147b0 <col:10> col:10 'struct data::tuple<> &&'
`-CXXDestructorDecl 0x2c3148f0 <col:10> col:10 implicit ~tuple 'void (void)' inline noexcept-unevaluated 0x2c3148f0

Layout: <CGRecordLayout
  LLVMType:%"struct.data::tuple.2" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.data::tuple.2" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c313b50 <./include/tuple.hpp:11:3, line:17:3> line:12:10 struct tuple definition
|-public 'tuple<>':'struct data::tuple<>'
|-TemplateArgument pack
| `-TemplateArgument type 'const char *'
|-CXXRecordDecl 0x2c313ed0 prev 0x2c313b50 <col:3, col:10> col:10 implicit struct tuple
|-CXXConstructorDecl 0x2c313fc0 <line:15:5> col:5 tuple 'void (const char *)'
| `-ParmVarDecl 0x2c313f30 <col:11, col:13> col:13 t 'const char *':'const char *'
|-FieldDecl 0x2c314050 <line:16:5, col:7> col:7 tail 'const char *':'const char *'
|-CXXConstructorDecl 0x2c3147f0 <line:12:10> col:10 implicit constexpr tuple 'void (const struct data::tuple<const char *> &)' inline noexcept-unevaluated 0x2c3147f0
| `-ParmVarDecl 0x2c3148a0 <col:10> col:10 'const struct data::tuple<const char *> &'
|-CXXConstructorDecl 0x2c3149a0 <col:10> col:10 implicit constexpr tuple 'void (struct data::tuple<const char *> &&)' inline noexcept-unevaluated 0x2c3149a0
| `-ParmVarDecl 0x2c314a50 <col:10> col:10 'struct data::tuple<const char *> &&'
`-CXXDestructorDecl 0x2c314b90 <col:10> col:10 implicit ~tuple 'void (void)' inline noexcept-unevaluated 0x2c314b90

Layout: <CGRecordLayout
  LLVMType:%"struct.data::tuple.1" = type { i8* }
  NonVirtualBaseLLVMType:%"struct.data::tuple.1" = type { i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c3138d0 <./include/tuple.hpp:11:3, line:17:3> line:12:10 struct tuple definition
|-public 'tuple<const char *>':'struct data::tuple<const char *>'
|-TemplateArgument pack
| |-TemplateArgument type 'unsigned long long'
| `-TemplateArgument type 'const char *'
|-CXXRecordDecl 0x2c3140b0 prev 0x2c3138d0 <col:3, col:10> col:10 implicit struct tuple
|-CXXConstructorDecl 0x2c314200 <line:15:5> col:5 tuple 'void (unsigned long long, const char *)'
| |-ParmVarDecl 0x2c314110 <col:11, col:13> col:13 t 'unsigned long long':'unsigned long long'
| `-ParmVarDecl 0x2c314150 <col:16, col:22> col:22 ts 'const char *':'const char *'
|-FieldDecl 0x2c314290 <line:16:5, col:7> col:7 tail 'unsigned long long':'unsigned long long'
|-CXXConstructorDecl 0x2c314a90 <line:12:10> col:10 implicit constexpr tuple 'void (const struct data::tuple<unsigned long long, const char *> &)' inline noexcept-unevaluated 0x2c314a90
| `-ParmVarDecl 0x2c314b40 <col:10> col:10 'const struct data::tuple<unsigned long long, const char *> &'
|-CXXConstructorDecl 0x2c314c40 <col:10> col:10 implicit constexpr tuple 'void (struct data::tuple<unsigned long long, const char *> &&)' inline noexcept-unevaluated 0x2c314c40
| `-ParmVarDecl 0x2c314cf0 <col:10> col:10 'struct data::tuple<unsigned long long, const char *> &&'
`-CXXDestructorDecl 0x2c314e30 <col:10> col:10 implicit ~tuple 'void (void)' inline noexcept-unevaluated 0x2c314e30

Layout: <CGRecordLayout
  LLVMType:%"struct.data::tuple.0" = type { %"struct.data::tuple.1", i64 }
  NonVirtualBaseLLVMType:%"struct.data::tuple.0" = type { %"struct.data::tuple.1", i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c313460 <./include/tuple.hpp:11:3, line:17:3> line:12:10 struct tuple definition
|-public 'tuple<unsigned long long, const char *>':'struct data::tuple<unsigned long long, const char *>'
|-TemplateArgument pack
| |-TemplateArgument type 'double'
| |-TemplateArgument type 'unsigned long long'
| `-TemplateArgument type 'const char *'
|-CXXRecordDecl 0x2c3142f0 prev 0x2c313460 <col:3, col:10> col:10 implicit struct tuple
|-CXXConstructorDecl 0x2c3144a0 <line:15:5> col:5 used tuple 'void (double, unsigned long long, const char *)'
| |-ParmVarDecl 0x2c314350 <col:11, col:13> col:13 t 'double':'double'
| |-ParmVarDecl 0x2c314390 <col:16, col:22> col:22 ts 'unsigned long long':'unsigned long long'
| `-ParmVarDecl 0x2c3143d0 <col:16, col:22> col:22 ts 'const char *':'const char *'
|-FieldDecl 0x2c314530 <line:16:5, col:7> col:7 tail 'double':'double'
|-CXXConstructorDecl 0x2c314d30 <line:12:10> col:10 implicit constexpr tuple 'void (const struct data::tuple<double, unsigned long long, const char *> &)' inline noexcept-unevaluated 0x2c314d30
| `-ParmVarDecl 0x2c314de0 <col:10> col:10 'const struct data::tuple<double, unsigned long long, const char *> &'
`-CXXConstructorDecl 0x2c314ee0 <col:10> col:10 implicit constexpr tuple 'void (struct data::tuple<double, unsigned long long, const char *> &&)' inline noexcept-unevaluated 0x2c314ee0
  `-ParmVarDecl 0x2c314f90 <col:10> col:10 'struct data::tuple<double, unsigned long long, const char *> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.data::tuple" = type { %"struct.data::tuple.0", double }
  NonVirtualBaseLLVMType:%"struct.data::tuple" = type { %"struct.data::tuple.0", double }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | struct data::elem_type_holder<2, struct data::tuple<double, unsigned long long, const char *> > (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c315250 <./include/tuple.hpp:29:3, line:33:3> line:30:10 struct elem_type_holder definition
|-TemplateArgument integral 2
|-TemplateArgument type 'struct data::tuple<double, unsigned long long, const char *>'
|-CXXRecordDecl 0x2c315700 prev 0x2c315250 <col:3, col:10> col:10 implicit struct elem_type_holder
|-TypedefDecl 0x2c316680 <line:32:5, col:64> col:64 type 'typename elem_type_holder<2U - 1, tuple<unsigned long long, const char *> >::type':'const char *'
|-CXXConstructorDecl 0x2c3166c0 <line:30:10> col:10 implicit used constexpr elem_type_holder 'void (void) noexcept' inline
| `-CompoundStmt 0x2c316968 <col:10>
|-CXXConstructorDecl 0x2c316770 <col:10> col:10 implicit constexpr elem_type_holder 'void (const struct data::elem_type_holder<2, struct data::tuple<double, unsigned long long, const char *> > &)' inline noexcept-unevaluated 0x2c316770
| `-ParmVarDecl 0x2c316820 <col:10> col:10 'const struct data::elem_type_holder<2, struct data::tuple<double, unsigned long long, const char *> > &'
`-CXXConstructorDecl 0x2c316880 <col:10> col:10 implicit constexpr elem_type_holder 'void (struct data::elem_type_holder<2, struct data::tuple<double, unsigned long long, const char *> > &&)' inline noexcept-unevaluated 0x2c316880
  `-ParmVarDecl 0x2c316930 <col:10> col:10 'struct data::elem_type_holder<2, struct data::tuple<double, unsigned long long, const char *> > &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.data::elem_type_holder" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.data::elem_type_holder" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | union (anonymous at /usr/include/c++/v1/memory:3314:9)
   0 |   float __t
   0 |   size_t __a
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | struct (anonymous at /usr/include/c++/v1/memory:3334:13)
   0 |   size_t __a
   4 |   size_t __b
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
   0 | union (anonymous at /usr/include/c++/v1/memory:3331:9)
   0 |   double __t
   0 |   struct (anonymous at /usr/include/c++/v1/memory:3334:13) 
   0 |     size_t __a
   4 |     size_t __b
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
   0 | struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (empty)
     | [sizeof=1, dsize=1, align=1
     |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
   0 | class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >
   0 |   struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (base) (empty)
   0 |   streambuf_type * __sbuf_
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry
   0 |   _Bool __ok_
   4 |   basic_ostream<char, struct std::__1::char_traits<char> > & __os_
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x2c2b7750 </usr/include/c++/v1/ostream:188:5, col:60> col:60 referenced class sentry definition
|-CXXRecordDecl 0x2c2b93b0 prev 0x2c2b7750 <line:226:1, col:88> col:88 implicit class sentry
|-FieldDecl 0x2c2b9400 <line:228:5, col:10> col:10 referenced __ok_ '_Bool'
|-FieldDecl 0x2c2b9500 <line:229:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x2c2b95f0 <line:231:5> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x2c2b9560 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-CXXMethodDecl 0x2c2b9710 <line:232:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x2c2b96a0 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-AccessSpecDecl 0x2c2b9780 <line:234:1, col:7> col:1 public
|-CXXConstructorDecl 0x2c2b98c0 <line:235:5, col:14> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x2c2b9840 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXDestructorDecl 0x2c2b9960 <line:236:5, col:6> col:5 used ~sentry 'void (void) noexcept'
`-CXXConversionDecl 0x2c2b99e0 <line:238:5, line:240:45> col:9 used operator bool '_Bool (void) const'
  |-CompoundStmt 0x2c338358 <col:31, col:45>
  | `-ReturnStmt 0x2c338348 <col:32, col:39>
  |   `-ImplicitCastExpr 0x2c338338 <col:39> '_Bool' <LValueToRValue>
  |     `-MemberExpr 0x2c338318 <col:39> 'const _Bool' lvalue ->__ok_ 0x2c2b9400
  |       `-CXXThisExpr 0x2c338308 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
  `-AlwaysInlineAttr 0x2c2b9a80 <line:238:47> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2bb15880 </usr/include/c++/v1/iterator:440:1, line:449:1> line:442:57 struct iterator definition
|-TemplateArgument type 'struct std::__1::output_iterator_tag'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-CXXRecordDecl 0x2bb15ab0 prev 0x2bb15880 <col:1, col:57> col:57 implicit struct iterator
|-TypedefDecl 0x2bb15b20 <line:444:5, col:17> col:17 value_type 'void':'void'
|-TypedefDecl 0x2bb15b70 <line:445:5, col:23> col:23 difference_type 'void':'void'
|-TypedefDecl 0x2bb15bc0 <line:446:5, col:22> col:22 pointer 'void':'void'
|-TypedefDecl 0x2bb15c10 <line:447:5, col:24> col:24 reference 'void':'void'
|-TypedefDecl 0x2bb15c60 <line:448:5, col:23> col:23 iterator_category 'struct std::__1::output_iterator_tag':'struct std::__1::output_iterator_tag'
|-CXXConstructorDecl 0x2c321ac0 <line:442:57> col:57 implicit constexpr iterator 'void (const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &)' inline noexcept-unevaluated 0x2c321ac0
| `-ParmVarDecl 0x2c321b70 <col:57> col:57 'const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &'
|-CXXConstructorDecl 0x2c321bd0 <col:57> col:57 implicit used constexpr iterator 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept' inline
| |-ParmVarDecl 0x2c321c80 <col:57> col:57 'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&'
| `-CompoundStmt 0x2c322e70 <col:57>
|-CXXDestructorDecl 0x2c321dc0 <col:57> col:57 implicit ~iterator 'void (void)' inline noexcept-unevaluated 0x2c321dc0
`-CXXConstructorDecl 0x2c322de0 <col:57> col:57 implicit used constexpr iterator 'void (void) noexcept' inline
  `-CompoundStmt 0x2c338458 <col:57>

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::iterator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::iterator" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | class std::__1::locale
   0 |   class std::__1::locale::__imp * __locale_
     | [sizeof=4, dsize=4, align=4
     |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
   0 | class std::__1::basic_streambuf<char>
   0 |   (basic_streambuf vtable pointer)
   4 |   class std::__1::locale __loc_
   4 |     class std::__1::locale::__imp * __locale_
     |   [sizeof=4, dsize=4, align=4
     |    nvsize=4, nvalign=4]
   8 |   char_type * __binp_
  12 |   char_type * __ninp_
  16 |   char_type * __einp_
  20 |   char_type * __bout_
  24 |   char_type * __nout_
  28 |   char_type * __eout_
     | [sizeof=32, dsize=32, align=4
     |  nvsize=32, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x2c0037e0 prev 0x2c0032f0 </usr/include/c++/v1/__locale:59:1, line:117:1> line:59:56 referenced class locale definition
|-TypeVisibilityAttr 0x2c003830 <col:23, col:52> Default
|-CXXRecordDecl 0x2c0038b0 <col:1, col:56> col:56 implicit referenced class locale
|-AccessSpecDecl 0x2c003900 <line:61:1, col:7> col:1 public
|-CXXRecordDecl 0x2c003940 <line:63:5, col:60> col:60 referenced class facet
| `-TypeVisibilityAttr 0x2c0039a0 <col:27, col:56> Default
|-CXXRecordDecl 0x2c0039f0 <line:64:5, col:60> col:60 referenced class id
| `-TypeVisibilityAttr 0x2c003a50 <col:27, col:56> Default
|-TypedefDecl 0x2c003a90 <line:66:5, col:17> col:17 referenced category 'int'
|-VarDecl 0x2c003ae0 <line:67:5, line:68:16> col:9 none 'const category':'const int' static cinit
| `-IntegerLiteral 0x2c003b10 <col:16> 'int' 0
|-VarDecl 0x2c003b70 <line:67:5, line:69:24> col:9 referenced collate 'const category':'const int' static cinit
| `-ParenExpr 0x2c003be8 <col:19, col:24> 'int'
|   `-BinaryOperator 0x2c003bd0 <col:20, col:23> 'int' '<<'
|     |-IntegerLiteral 0x2c003ba0 <col:20> 'int' 1
|     `-IntegerLiteral 0x2c003bb8 <col:23> 'int' 0
|-VarDecl 0x2c003c40 <line:67:5, line:70:22> col:9 referenced ctype 'const category':'const int' static cinit
| `-ParenExpr 0x2c003cb8 <col:17, col:22> 'int'
|   `-BinaryOperator 0x2c003ca0 <col:18, col:21> 'int' '<<'
|     |-IntegerLiteral 0x2c003c70 <col:18> 'int' 1
|     `-IntegerLiteral 0x2c003c88 <col:21> 'int' 1
|-VarDecl 0x2c003d10 <line:67:5, line:71:25> col:9 referenced monetary 'const category':'const int' static cinit
| `-ParenExpr 0x2c003d88 <col:20, col:25> 'int'
|   `-BinaryOperator 0x2c003d70 <col:21, col:24> 'int' '<<'
|     |-IntegerLiteral 0x2c003d40 <col:21> 'int' 1
|     `-IntegerLiteral 0x2c003d58 <col:24> 'int' 3
|-VarDecl 0x2c003de0 <line:67:5, line:72:24> col:9 referenced numeric 'const category':'const int' static cinit
| `-ParenExpr 0x2c003e58 <col:19, col:24> 'int'
|   `-BinaryOperator 0x2c003e40 <col:20, col:23> 'int' '<<'
|     |-IntegerLiteral 0x2c003e10 <col:20> 'int' 1
|     `-IntegerLiteral 0x2c003e28 <col:23> 'int' 4
|-VarDecl 0x2c003eb0 <line:67:5, line:73:21> col:9 referenced time 'const category':'const int' static cinit
| `-ParenExpr 0x2c003f28 <col:16, col:21> 'int'
|   `-BinaryOperator 0x2c003f10 <col:17, col:20> 'int' '<<'
|     |-IntegerLiteral 0x2c003ee0 <col:17> 'int' 1
|     `-IntegerLiteral 0x2c003ef8 <col:20> 'int' 5
|-VarDecl 0x2c003f80 <line:67:5, line:74:25> col:9 referenced messages 'const category':'const int' static cinit
| `-ParenExpr 0x2c003ff8 <col:20, col:25> 'int'
|   `-BinaryOperator 0x2c003fe0 <col:21, col:24> 'int' '<<'
|     |-IntegerLiteral 0x2c003fb0 <col:21> 'int' 1
|     `-IntegerLiteral 0x2c003fc8 <col:24> 'int' 2
|-VarDecl 0x2c004050 <line:67:5, line:75:61> col:9 all 'const category':'const int' static cinit
| `-BinaryOperator 0x2c0041d0 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x2c004190 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x2c004150 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x2c004110 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x2c0040d0 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x2c0040b0 <col:15> 'category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x2c004080 <col:15> 'const category':'const int' lvalue Var 0x2c003b70 'collate' 'const category':'const int'
|   | | | | `-ImplicitCastExpr 0x2c0040c0 <col:25> 'category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x2c004098 <col:25> 'const category':'const int' lvalue Var 0x2c003c40 'ctype' 'const category':'const int'
|   | | | `-ImplicitCastExpr 0x2c004100 <col:33> 'category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x2c0040e8 <col:33> 'const category':'const int' lvalue Var 0x2c003d10 'monetary' 'const category':'const int'
|   | | `-ImplicitCastExpr 0x2c004140 <col:44> 'category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x2c004128 <col:44> 'const category':'const int' lvalue Var 0x2c003de0 'numeric' 'const category':'const int'
|   | `-ImplicitCastExpr 0x2c004180 <col:54> 'category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x2c004168 <col:54> 'const category':'const int' lvalue Var 0x2c003eb0 'time' 'const category':'const int'
|   `-ImplicitCastExpr 0x2c0041c0 <col:61> 'category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x2c0041a8 <col:61> 'const category':'const int' lvalue Var 0x2c003f80 'messages' 'const category':'const int'
|-CXXConstructorDecl 0x2c004290 <line:78:5, col:14> col:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x2c0043a0 <line:79:5, col:27> col:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x2c004310 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x2c004480 <line:80:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x2c004430 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x2c004560 <line:81:5, col:34> col:14 locale 'void (const string &)'
| `-ParmVarDecl 0x2c004510 <col:21, col:33> col:34 'const string &'
|-CXXConstructorDecl 0x2c004720 <line:82:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, category)'
| |-ParmVarDecl 0x2c0045f0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x2c004630 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x2c004670 <col:40> col:48 'category':'int'
|-CXXConstructorDecl 0x2c0048e0 <line:83:5, col:50> col:5 locale 'void (const class std::__1::locale &, const string &, category)'
| |-ParmVarDecl 0x2c0047b0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x2c0047f0 <col:27, col:39> col:40 'const string &'
| `-ParmVarDecl 0x2c004830 <col:42> col:50 'category':'int'
|-FunctionTemplateDecl 0x2c004b50 <line:84:5, line:85:100> col:71 locale
| |-TemplateTypeParmDecl 0x2c004960 <line:84:15, col:21> col:21 referenced class _Facet
| `-CXXConstructorDecl 0x2c004ae0 <line:85:9, col:100> col:71 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x2c0049f0 <col:78, col:90> col:91 'const class std::__1::locale &'
|   |-ParmVarDecl 0x2c004a50 <col:93, col:99> col:100 '_Facet *'
|   |-AlwaysInlineAttr 0x2c004b80 <col:51> always_inline
|   `-VisibilityAttr 0x2c004bb0 <col:25, col:48> Hidden
|-CXXConstructorDecl 0x2c004d10 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, category)'
| |-ParmVarDecl 0x2c004be0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x2c004c20 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x2c004c60 <col:42> col:50 'category':'int'
|-CXXDestructorDecl 0x2c004dd0 <line:88:5, col:13> col:5 used ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x2c004ee0 <line:90:5, col:44> col:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x2c004e50 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x2c0050b0 <line:92:5, col:59> col:36 combine
| |-TemplateTypeParmDecl 0x2c004f50 <col:15, col:21> col:21 class _Facet
| `-CXXMethodDecl 0x2c005050 <col:29, col:59> col:36 combine 'class std::__1::locale (const class std::__1::locale &) const'
|   `-ParmVarDecl 0x2c004fc0 <col:44, col:56> col:57 'const class std::__1::locale &'
|-CXXMethodDecl 0x2c005100 <line:95:5, col:19> col:12 name 'string (void) const'
|-CXXMethodDecl 0x2c0051e0 <line:96:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x2c005170 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x2c0052b0 <line:97:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x2c005260 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x2c007150 <col:46, col:70>
|   `-ReturnStmt 0x2c007140 <col:47, col:68>
|     `-UnaryOperator 0x2c007128 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x2c007110 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x2c0070d8 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x2c0070c8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x2c007098 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x2c0051e0 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x2c0063b0 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x2c0063a0 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x2c0063c4 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x2c005260 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x2c005840 <line:98:5, line:100:73> line:99:12 operator()
| |-TemplateTypeParmDecl 0x2c005320 <line:98:15, col:21> col:21 referenced class _CharT
| |-TemplateTypeParmDecl 0x2c005370 <col:29, col:35> col:35 referenced class _Traits
| |-TemplateTypeParmDecl 0x2c0053c0 <col:44, col:50> col:50 referenced class _Allocator
| `-CXXMethodDecl 0x2c0057e0 <line:99:7, line:100:73> line:99:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const'
|   |-ParmVarDecl 0x2c0055a0 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-ParmVarDecl 0x2c005750 <line:100:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|-CXXMethodDecl 0x2c0058f0 <line:103:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x2c005880 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x2c0059a0 <line:104:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x2c005a00 <line:106:1, col:8> col:1 private
|-CXXRecordDecl 0x2c005a20 <line:107:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x2c005ab0 <line:108:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x2c005c10 <line:110:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x2c005af0 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x2c005b50 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x2c005b90 <col:48> col:52 'long'
|-CXXMethodDecl 0x2c005ce0 <line:111:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x2c005de0 <line:112:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x2c005d70 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x2c005ef0 <line:113:5, col:33> col:18 used use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x2c005e60 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x2c006120 <line:115:5, col:66> col:41
| `-FunctionTemplateDecl 0x2c006090 parent 0x2c003290 prev 0x2c003520 <col:5, col:66> col:41 has_facet
|   |-TemplateTypeParmDecl 0x2c005f60 <col:15, col:21> col:21 class _Facet
|   `-FunctionDecl 0x2c006020 parent 0x2c003290 prev 0x2c0034c0 <col:29, col:66> col:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x2c005fd0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x2c0060f0 <line:50:43> Inherited always_inline
|     `-VisibilityAttr 0x2c006100 <col:17, col:40> Inherited Hidden
`-FriendDecl 0x2c006350 <line:116:5, col:73> col:50
  `-FunctionTemplateDecl 0x2c0062c0 parent 0x2c003290 prev 0x2c003740 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x2c006150 <col:15, col:21> col:21 referenced class _Facet
    |-FunctionDecl 0x2c006250 parent 0x2c003290 prev 0x2c0036e0 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
    | |-ParmVarDecl 0x2c0061c0 <col:60, col:72> col:73 'const class std::__1::locale &'
    | |-AlwaysInlineAttr 0x2c006320 <line:55:43> Inherited always_inline
    | `-VisibilityAttr 0x2c006330 <col:17, col:40> Inherited Hidden
    `-Function 0x2c31fb70 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2b8e1060 parent 0x2b93ac40 </usr/include/c++/v1/streambuf:556:1, col:92> col:72 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TypeVisibilityAttr 0x2c091920 <col:39, col:68> Default
|-CXXRecordDecl 0x2c0919b0 prev 0x2b8e1060 <line:122:1, col:56> col:56 implicit class basic_streambuf
|-AccessSpecDecl 0x2c091a00 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x2c091a40 <line:126:5, col:20> col:20 char_type 'char':'char'
|-TypedefDecl 0x2c091a90 <line:127:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|-TypedefDecl 0x2c091b20 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
|-TypedefDecl 0x2c091ba0 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
|-TypedefDecl 0x2c091c20 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
|-CXXDestructorDecl 0x2c091c60 <line:132:5, col:14> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x2c091d10 <line:135:5, col:40> col:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x2c091ce0 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x2c091da0 <line:223:50> always_inline
|-CXXMethodDecl 0x2c091dd0 <line:136:5, col:21> col:12 getloc 'class std::__1::locale (void) const'
| `-AlwaysInlineAttr 0x2c091e40 <line:234:50> always_inline
|-CXXMethodDecl 0x2c091f80 <line:139:5, col:62> col:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(char_type *, streamsize)'
| |-ParmVarDecl 0x2c091eb0 <col:32, col:43> col:43 __s 'char_type *'
| |-ParmVarDecl 0x2c091ee0 <col:48, col:59> col:59 __n 'streamsize':'int'
| `-AlwaysInlineAttr 0x2c091ff0 <line:242:50> always_inline
|-CXXMethodDecl 0x2c092160 <line:140:5, line:141:82> line:140:14 referenced pubseekoff 'pos_type (off_type, class ios_base::seekdir, class ios_base::openmode)'
| |-ParmVarDecl 0x2c092050 <col:25, col:34> col:34 __off 'off_type':'long long'
| |-ParmVarDecl 0x2c092080 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x2c0920b0 <line:141:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x2c0921e0 <line:250:50> always_inline
|-CXXMethodDecl 0x2c0922d0 <line:142:5, line:143:82> line:142:14 referenced pubseekpos 'pos_type (pos_type, class ios_base::openmode)'
| |-ParmVarDecl 0x2c092210 <col:25, col:34> col:34 __sp 'pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x2c092240 <line:143:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x2c092340 <line:260:50> always_inline
|-CXXMethodDecl 0x2c092370 <line:144:5, col:17> col:9 referenced pubsync 'int (void)'
| `-AlwaysInlineAttr 0x2c0923e0 <line:269:50> always_inline
|-CXXMethodDecl 0x2c092410 <line:148:5, col:25> col:16 in_avail 'streamsize (void)'
| `-AlwaysInlineAttr 0x2c092480 <line:277:50> always_inline
|-CXXMethodDecl 0x2c0924f0 <line:149:5, col:21> col:14 snextc 'int_type (void)'
| `-AlwaysInlineAttr 0x2c092560 <line:287:50> always_inline
|-CXXMethodDecl 0x2c0925a0 <line:150:5, col:21> col:14 sbumpc 'int_type (void)'
| `-AlwaysInlineAttr 0x2c092610 <line:297:50> always_inline
|-CXXMethodDecl 0x2c092650 <line:151:5, col:20> col:14 sgetc 'int_type (void)'
| `-AlwaysInlineAttr 0x2c0926c0 <line:307:50> always_inline
|-CXXMethodDecl 0x2c0927a0 <line:152:5, col:52> col:16 referenced sgetn 'streamsize (char_type *, streamsize)'
| |-ParmVarDecl 0x2c092700 <col:22, col:33> col:33 __s 'char_type *'
| |-ParmVarDecl 0x2c092730 <col:38, col:49> col:49 __n 'streamsize':'int'
| `-AlwaysInlineAttr 0x2c092810 <line:317:50> always_inline
|-CXXMethodDecl 0x2c0928b0 <line:155:5, col:37> col:14 sputbackc 'int_type (char_type)'
| |-ParmVarDecl 0x2c092840 <col:24, col:34> col:34 __c 'char_type':'char'
| `-AlwaysInlineAttr 0x2c092920 <line:325:50> always_inline
|-CXXMethodDecl 0x2c092960 <line:156:5, col:22> col:14 sungetc 'int_type (void)'
| `-AlwaysInlineAttr 0x2c0929d0 <line:335:50> always_inline
|-CXXMethodDecl 0x2c092a50 <line:159:5, col:33> col:14 sputc 'int_type (char_type)'
| |-ParmVarDecl 0x2c092a00 <col:20, col:30> col:30 __c 'char_type':'char'
| `-AlwaysInlineAttr 0x2c092ac0 <line:345:50> always_inline
|-CXXMethodDecl 0x2c092bc0 <line:356:1, line:361:1> line:160:16 used sputn 'streamsize (const char_type *, streamsize)'
| |-ParmVarDecl 0x2c092b20 <col:22, col:39> col:39 used __s 'const char_type *'
| |-ParmVarDecl 0x2c092b50 <col:44, col:55> col:55 used __n 'streamsize':'int'
| |-CompoundStmt 0x2c33a0c0 <line:359:1, line:361:1>
| | `-ReturnStmt 0x2c33a0b0 <line:360:5, col:27>
| |   `-CXXMemberCallExpr 0x2c33a068 <col:12, col:27> 'streamsize':'int'
| |     |-MemberExpr 0x2c33a018 <col:12> '<bound member function type>' ->xsputn 0x2c094270
| |     | `-CXXThisExpr 0x2c33a008 <col:12> 'class std::__1::basic_streambuf<char> *' this
| |     |-ImplicitCastExpr 0x2c33a090 <col:19> 'const char_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x2c33a038 <col:19> 'const char_type *' lvalue ParmVar 0x2c092b20 '__s' 'const char_type *'
| |     `-ImplicitCastExpr 0x2c33a0a0 <col:24> 'streamsize':'int' <LValueToRValue>
| |       `-DeclRefExpr 0x2c33a050 <col:24> 'streamsize':'int' lvalue ParmVar 0x2c092b50 '__n' 'streamsize':'int'
| `-AlwaysInlineAttr 0x2c092c30 <line:356:50> always_inline
|-AccessSpecDecl 0x2c092c60 <line:162:1, col:10> col:1 protected
|-CXXConstructorDecl 0x2c092ca0 <line:163:5> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x2c092dd0 <line:164:5> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x2c092d50 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x2c092ef0 <line:165:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x2c092e80 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x2c092fe0 <line:166:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x2c092f70 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x2c0930b0 <line:169:5, col:108> col:78 eback 'char_type *(void) const'
| `-AlwaysInlineAttr 0x2c093120 <col:47> always_inline
|-CXXMethodDecl 0x2c093170 <line:170:5, col:107> col:78 gptr 'char_type *(void) const'
| `-AlwaysInlineAttr 0x2c0931e0 <col:47> always_inline
|-CXXMethodDecl 0x2c093230 <line:171:5, col:108> col:78 egptr 'char_type *(void) const'
| `-AlwaysInlineAttr 0x2c0932a0 <col:47> always_inline
|-CXXMethodDecl 0x2c093300 <line:172:5, col:23> col:10 gbump 'void (int)'
| |-ParmVarDecl 0x2c0932d0 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x2c093370 <line:414:50> always_inline
|-CXXMethodDecl 0x2c0934e0 <line:173:5, col:71> col:10 setg 'void (char_type *, char_type *, char_type *)'
| |-ParmVarDecl 0x2c0933b0 <col:15, col:26> col:26 __gbeg 'char_type *'
| |-ParmVarDecl 0x2c0933f0 <col:34, col:45> col:45 __gnext 'char_type *'
| |-ParmVarDecl 0x2c093430 <col:54, col:65> col:65 __gend 'char_type *'
| `-AlwaysInlineAttr 0x2c093560 <line:422:50> always_inline
|-CXXMethodDecl 0x2c0935b0 <line:176:5, col:108> col:78 pbase 'char_type *(void) const'
| `-AlwaysInlineAttr 0x2c093620 <col:47> always_inline
|-CXXMethodDecl 0x2c093670 <line:177:5, col:107> col:78 pptr 'char_type *(void) const'
| `-AlwaysInlineAttr 0x2c0936e0 <col:47> always_inline
|-CXXMethodDecl 0x2c093730 <line:178:5, col:108> col:78 epptr 'char_type *(void) const'
| `-AlwaysInlineAttr 0x2c0937a0 <col:47> always_inline
|-CXXMethodDecl 0x2c093800 <line:179:5, col:23> col:10 pbump 'void (int)'
| |-ParmVarDecl 0x2c0937d0 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x2c093870 <line:433:50> always_inline
|-CXXMethodDecl 0x2c093980 <line:180:5, col:51> col:10 setp 'void (char_type *, char_type *)'
| |-ParmVarDecl 0x2c0938b0 <col:15, col:26> col:26 __pbeg 'char_type *'
| |-ParmVarDecl 0x2c0938f0 <col:34, col:45> col:45 __pend 'char_type *'
| `-AlwaysInlineAttr 0x2c0939f0 <line:441:50> always_inline
|-CXXMethodDecl 0x2c093a50 <line:184:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x2c093a20 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x2c093b60 <line:187:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(char_type *, streamsize)' virtual
| |-ParmVarDecl 0x2c093ad0 <col:37, col:48> col:48 __s 'char_type *'
| `-ParmVarDecl 0x2c093b00 <col:53, col:64> col:64 __n 'streamsize':'int'
|-CXXMethodDecl 0x2c093ca0 <line:188:5, line:189:87> line:188:22 seekoff 'pos_type (off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x2c093be0 <col:30, col:39> col:39 __off 'off_type':'long long'
| |-ParmVarDecl 0x2c093c10 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x2c093c40 <line:189:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x2c093da0 <line:190:5, line:191:87> line:190:22 seekpos 'pos_type (pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x2c093d20 <col:30, col:39> col:39 __sp 'pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x2c093d50 <line:191:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x2c093e10 <line:192:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x2c093e80 <line:195:5, col:34> col:24 showmanyc 'streamsize (void)' virtual
|-CXXMethodDecl 0x2c093f80 <line:196:5, col:61> col:24 xsgetn 'streamsize (char_type *, streamsize)' virtual
| |-ParmVarDecl 0x2c093f00 <col:31, col:42> col:42 __s 'char_type *'
| `-ParmVarDecl 0x2c093f30 <col:47, col:58> col:58 __n 'streamsize':'int'
|-CXXMethodDecl 0x2c094010 <line:197:5, col:32> col:22 underflow 'int_type (void)' virtual
|-CXXMethodDecl 0x2c094090 <line:198:5, col:28> col:22 uflow 'int_type (void)' virtual
|-CXXMethodDecl 0x2c094170 <line:201:5, col:65> col:22 pbackfail 'int_type (int_type)' virtual
| `-ParmVarDecl 0x2c094100 <col:32, col:64> col:41 __c 'int_type':'int'
|-CXXMethodDecl 0x2c094270 <line:204:5, col:67> col:24 used xsputn 'streamsize (const char_type *, streamsize)' virtual
| |-ParmVarDecl 0x2c0941f0 <col:31, col:48> col:48 __s 'const char_type *'
| `-ParmVarDecl 0x2c094220 <col:53, col:64> col:64 __n 'streamsize':'int'
|-CXXMethodDecl 0x2c094340 <line:205:5, col:64> col:22 overflow 'int_type (int_type)' virtual
| `-ParmVarDecl 0x2c0942f0 <col:31, col:63> col:40 __c 'int_type':'int'
|-AccessSpecDecl 0x2c0943b0 <line:207:1, col:8> col:1 private
|-FieldDecl 0x2c0943d0 <line:208:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x2c094410 <line:209:5, col:16> col:16 __binp_ 'char_type *'
|-FieldDecl 0x2c094450 <line:210:5, col:16> col:16 __ninp_ 'char_type *'
|-FieldDecl 0x2c094490 <line:211:5, col:16> col:16 __einp_ 'char_type *'
|-FieldDecl 0x2c0944d0 <line:212:5, col:16> col:16 __bout_ 'char_type *'
|-FieldDecl 0x2c094510 <line:213:5, col:16> col:16 __nout_ 'char_type *'
`-FieldDecl 0x2c094550 <line:214:5, col:16> col:16 __eout_ 'char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c143690 </usr/include/c++/v1/iterator:895:1, line:934:1> line:896:56 class ostreambuf_iterator definition
|-public 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x2c320a20 prev 0x2c143690 <col:1, col:56> col:56 implicit class ostreambuf_iterator
|-AccessSpecDecl 0x2c320a70 <line:899:1, col:7> col:1 public
|-TypedefDecl 0x2c320ab0 <line:900:5, col:20> col:20 char_type 'char':'char'
|-TypedefDecl 0x2c320b00 <line:901:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|-TypedefDecl 0x2c320bc0 <line:902:5, col:45> col:45 streambuf_type 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TypedefDecl 0x2c320c80 <line:903:5, col:43> col:43 ostream_type 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-AccessSpecDecl 0x2c320cb0 <line:904:1, col:8> col:1 private
|-FieldDecl 0x2c320d10 <line:905:5, col:21> col:21 referenced __sbuf_ 'streambuf_type *'
|-AccessSpecDecl 0x2c320d40 <line:906:1, col:7> col:1 public
|-CXXConstructorDecl 0x2c320e30 <line:907:5, line:908:33> line:907:67 used ostreambuf_iterator 'void (ostream_type &) noexcept'
| |-ParmVarDecl 0x2c320da0 <col:87, col:101> col:101 used __s 'ostream_type &'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x2c338468 <col:67> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x2c320d10 '__sbuf_' 'streambuf_type *'
| | `-CXXMemberCallExpr 0x2c3383e8 <line:908:19, col:29> 'basic_streambuf<char_type, traits_type> *'
| |   `-MemberExpr 0x2c3383c4 <col:19, col:23> '<bound member function type>' .rdbuf 0x2c0986c0
| |     `-ImplicitCastExpr 0x2c338408 <col:19> 'const class std::__1::basic_ios<char>' lvalue <UncheckedDerivedToBase (virtual basic_ios)>
| |       `-DeclRefExpr 0x2c33836c <col:19> 'ostream_type':'class std::__1::basic_ostream<char>' lvalue ParmVar 0x2c320da0 '__s' 'ostream_type &'
| |-CompoundStmt 0x2bb22740 <col:32, col:33>
| `-AlwaysInlineAttr 0x2c320ed0 <line:907:47> always_inline
|-CXXConstructorDecl 0x2c320f90 <line:909:5, col:67> col:67 ostreambuf_iterator 'void (streambuf_type *) noexcept'
| |-ParmVarDecl 0x2c320f10 <col:87, col:103> col:103 __s 'streambuf_type *'
| `-AlwaysInlineAttr 0x2c321010 <col:47> always_inline
|-CXXMethodDecl 0x2c3210f0 <line:911:5, line:916:9> line:911:88 operator= 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(char)'
| |-ParmVarDecl 0x2c321060 <col:98, col:105> col:105 __c 'char':'char'
| `-AlwaysInlineAttr 0x2c321160 <col:47> always_inline
|-CXXMethodDecl 0x2c3211d0 <line:917:5, col:114> col:88 operator* 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x2c321240 <col:47> always_inline
|-CXXMethodDecl 0x2c321290 <line:918:5, col:115> col:88 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x2c321300 <col:47> always_inline
|-CXXMethodDecl 0x2c3213a0 <line:919:5, col:118> col:88 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(int)'
| |-ParmVarDecl 0x2c321330 <col:99> col:102 'int'
| `-AlwaysInlineAttr 0x2c321410 <col:47> always_inline
|-CXXMethodDecl 0x2c321440 <line:920:5, col:117> col:72 used failed '_Bool (void) const noexcept'
| |-CompoundStmt 0x2c33cc28 <col:96, col:117>
| | `-ReturnStmt 0x2c33cc18 <col:97, col:115>
| |   `-BinaryOperator 0x2c33cc00 <col:104, col:115> '_Bool' '=='
| |     |-ImplicitCastExpr 0x2c33cbe0 <col:104> 'streambuf_type *' <LValueToRValue>
| |     | `-MemberExpr 0x2c33cbc0 <col:104> 'streambuf_type *const' lvalue ->__sbuf_ 0x2c320d10
| |     |   `-CXXThisExpr 0x2c33cbb0 <col:104> 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > *' this
| |     `-ImplicitCastExpr 0x2c33cbf0 <col:115> 'streambuf_type *' <NullToPointer>
| |       `-IntegerLiteral 0x2bb22ba8 <col:115> 'int' 0
| `-AlwaysInlineAttr 0x2c3214b0 <col:47> always_inline
|-FriendDecl 0x2c321a40 <line:926:5, line:932:47> line:930:5
| `-FunctionTemplateDecl 0x2c321980 parent 0x2bafd040 prev 0x2bcda560 <line:926:5, line:932:47> line:930:5 __pad_and_output
|   |-TemplateTypeParmDecl 0x2c3214e0 <line:926:15, col:21> col:21 class _Ch
|   |-TemplateTypeParmDecl 0x2c321530 <col:26, col:32> col:32 class _Tr
|   |-FunctionDecl 0x2c321900 parent 0x2bafd040 prev 0x2bcda500 <line:927:5, line:932:47> line:930:5 __pad_and_output 'ostreambuf_iterator<_Ch, _Tr> (ostreambuf_iterator<_Ch, _Tr>, const _Ch *, const _Ch *, const _Ch *, class std::__1::ios_base &, _Ch)'
|   | |-ParmVarDecl 0x2c3216f0 <col:22, col:52> col:52 __s 'ostreambuf_iterator<_Ch, _Tr>'
|   | |-ParmVarDecl 0x2c321750 <line:931:22, col:33> col:33 __ob 'const _Ch *'
|   | |-ParmVarDecl 0x2c321790 <col:39, col:50> col:50 __op 'const _Ch *'
|   | |-ParmVarDecl 0x2c3217d0 <col:56, col:67> col:67 __oe 'const _Ch *'
|   | |-ParmVarDecl 0x2c321800 <line:932:22, col:32> col:32 __iob 'class std::__1::ios_base &'
|   | |-ParmVarDecl 0x2c321840 <col:39, col:43> col:43 __fl '_Ch'
|   | `-VisibilityAttr 0x2c3219d0 </usr/include/c++/v1/locale:1480:17, col:40> Inherited Hidden
|   `-Function 0x2c322c00 '__pad_and_output' 'ostreambuf_iterator<char, struct std::__1::char_traits<char> > (ostreambuf_iterator<char, struct std::__1::char_traits<char> >, const char *, const char *, const char *, class std::__1::ios_base &, char)'
|-CXXConstructorDecl 0x2c321cc0 </usr/include/c++/v1/iterator:896:56> col:56 implicit constexpr ostreambuf_iterator 'void (const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &)' inline noexcept-unevaluated 0x2c321cc0
| `-ParmVarDecl 0x2c321d70 <col:56> col:56 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x2c321e70 <col:56> col:56 implicit used constexpr ostreambuf_iterator 'void (class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&) noexcept' inline
| |-ParmVarDecl 0x2c321f20 <col:56> col:56 used 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x2c322ea0 <col:56> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept'
| |   `-ImplicitCastExpr 0x2c322dc8 <col:56> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' xvalue <UncheckedDerivedToBase (iterator)>
| |     `-CXXStaticCastExpr 0x2c322da8 <col:56> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x2c322d7c <col:56> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x2c321f20 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer Field 0x2c320d10 '__sbuf_' 'streambuf_type *'
| | `-ImplicitCastExpr 0x2c322ff0 <col:56> 'streambuf_type *' <LValueToRValue>
| |   `-MemberExpr 0x2c322fc0 <col:56> 'streambuf_type *' xvalue .__sbuf_ 0x2c320d10
| |     `-CXXStaticCastExpr 0x2c322fa0 <col:56> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x2c322f78 <col:56> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x2c321f20 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| `-CompoundStmt 0x2c338020 <col:56>
`-CXXDestructorDecl 0x2c321f90 <col:56> col:56 implicit referenced ~ostreambuf_iterator 'void (void)' inline noexcept-unevaluated 0x2c321f90

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  NonVirtualBaseLLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | class std::__1::__shared_count
   0 |   (__shared_count vtable pointer)
   4 |   long __shared_owners_
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x2bc62480 </usr/include/c++/v1/memory:3583:1, line:3603:1> line:3583:56 referenced class __shared_count definition
|-TypeVisibilityAttr 0x2bc624e0 <col:23, col:52> Default
|-CXXRecordDecl 0x2bc62560 <col:1, col:56> col:56 implicit referenced class __shared_count
|-CXXConstructorDecl 0x2bc62680 <line:3585:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x2bc625e0 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x2bc627a0 <line:3586:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x2bc62710 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x2bc62810 <line:3588:1, col:10> col:1 protected
|-FieldDecl 0x2bc62840 <line:3589:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x2bc628b0 <line:3590:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x2bc62920 <line:3591:1, col:8> col:1 private
|-CXXMethodDecl 0x2bc62950 <line:3592:5, col:48> col:18 __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x2bc629d0 <line:3594:1, col:7> col:1 public
|-CXXConstructorDecl 0x2bc62a90 <line:3595:5, line:3597:37> line:3596:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x2bc62a20 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x2bc62de8 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x2bc62dd0 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x2bc62840 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x2bc62e30 <line:3597:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x2bc62df4 <col:28> 'long' lvalue ParmVar 0x2bc62a20 '__refs' 'long'
| |-CompoundStmt 0x2bc62e60 <col:36, col:37>
| |-AlwaysInlineAttr 0x2bc62b10 <line:3595:47> always_inline
| `-VisibilityAttr 0x2bc62b40 <col:21, col:44> Hidden
|-CXXMethodDecl 0x2bc62b70 <line:3599:5, col:25> col:10 __add_shared 'void (void) noexcept'
|-CXXMethodDecl 0x2bc62bf0 <line:3600:5, col:29> col:10 __release_shared '_Bool (void) noexcept'
`-CXXMethodDecl 0x2bc62d00 <line:3601:5, line:3602:66> col:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x2bc62f00 <col:37, col:66>
  | `-ReturnStmt 0x2bc62ef0 <col:38, col:64>
  |   `-BinaryOperator 0x2bc62ed8 <col:45, col:64> 'long' '+'
  |     |-ImplicitCastExpr 0x2bc62eb8 <col:45> 'long' <LValueToRValue>
  |     | `-MemberExpr 0x2bc62e80 <col:45> 'const long' lvalue ->__shared_owners_ 0x2bc62840
  |     |   `-CXXThisExpr 0x2bc62e70 <col:45> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x2bc62ec8 <col:64> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x2bc62ea0 <col:64> 'int' 1
  |-AlwaysInlineAttr 0x2bc62d60 <line:3601:47> always_inline
  `-VisibilityAttr 0x2bc62d90 <col:21, col:44> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i32 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | class std::__1::locale::facet
   0 |   class std::__1::__shared_count (primary base)
   0 |     (__shared_count vtable pointer)
   4 |     long __shared_owners_
     | [sizeof=8, dsize=8, align=4
     |  nvsize=8, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x2c0071a0 parent 0x2c0037e0 prev 0x2c003940 </usr/include/c++/v1/__locale:119:1, line:133:1> line:119:64 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-TypeVisibilityAttr 0x2c007210 <col:23, col:52> Default
|-CXXRecordDecl 0x2c0072d0 <col:1, col:64> col:64 implicit referenced class facet
|-AccessSpecDecl 0x2c007320 <line:122:1, col:10> col:1 protected
|-CXXConstructorDecl 0x2c0073f0 <line:123:5, line:125:56> line:124:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x2c007370 <col:20, col:36> col:27 used __refs 'size_t':'unsigned int' cinit
| | `-ImplicitCastExpr 0x2c007740 <col:36> 'size_t':'unsigned int' <IntegralCast>
| |   `-IntegerLiteral 0x2c007728 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x2c007820 <line:125:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x2c0077e0 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x2c007798 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x2c007788 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x2c007778 <col:44> 'size_t':'unsigned int' <LValueToRValue>
| |     |     `-DeclRefExpr 0x2c00774c <col:44> 'size_t':'unsigned int' lvalue ParmVar 0x2c007370 '__refs' 'size_t':'unsigned int'
| |     `-ImplicitCastExpr 0x2c0077d0 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x2c0077b8 <col:52> 'int' 1
| |-CompoundStmt 0x2c007870 <col:55, col:56>
| |-AlwaysInlineAttr 0x2c007470 <line:123:47> always_inline
| `-VisibilityAttr 0x2c0074a0 <col:21, col:44> Hidden
|-CXXDestructorDecl 0x2c0074f0 <line:127:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x2c007560 <line:131:1, col:8> col:1 private
|-CXXMethodDecl 0x2c007590 <line:132:5, col:37> col:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x2c007650 <line:119:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline noexcept-unevaluated 0x2c007650
| `-ParmVarDecl 0x2c0076f0 <col:64> col:64 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x2c00a4d0 <col:64> col:64 implicit facet 'void (const class std::__1::locale::facet &)' inline noexcept-unevaluated 0x2c00a4d0
  `-ParmVarDecl 0x2c00a580 <col:64> col:64 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | class std::__1::ctype_base (empty)
     | [sizeof=1, dsize=0, align=1
     |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x2c013e10 </usr/include/c++/v1/__locale:328:1, line:413:1> line:328:56 referenced class ctype_base definition
|-TypeVisibilityAttr 0x2c013e70 <col:23, col:52> Default
|-CXXRecordDecl 0x2c013ef0 <col:1, col:56> col:56 implicit referenced class ctype_base
|-AccessSpecDecl 0x2c013f40 <line:330:1, col:7> col:1 public
|-TypedefDecl 0x2c013f70 <line:359:5, col:27> col:27 referenced mask 'unsigned long'
|-VarDecl 0x2c013fc0 <line:365:5, col:31> col:23 referenced space 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c014008 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c013ff0 <col:31> 'long' 16384
|-VarDecl 0x2c014060 <line:366:5, col:31> col:23 referenced print 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c0140a8 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c014090 <col:31> 'long' 262144
|-VarDecl 0x2c014100 <line:367:5, col:31> col:23 referenced cntrl 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c014148 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c014130 <col:31> 'long' 512
|-VarDecl 0x2c0141a0 <line:368:5, col:31> col:23 referenced upper 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c0141e8 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c0141d0 <col:31> 'long' 32768
|-VarDecl 0x2c014240 <line:369:5, col:31> col:23 referenced lower 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c014288 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c014270 <col:31> 'long' 4096
|-VarDecl 0x2c0142e0 <line:370:5, col:31> col:23 referenced alpha 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c014328 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c014310 <col:31> 'long' 256
|-VarDecl 0x2c014380 <line:371:5, col:31> col:23 referenced digit 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c0143c8 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c0143b0 <col:31> 'long' 1024
|-VarDecl 0x2c014420 <line:372:5, col:31> col:23 referenced punct 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c014468 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c014450 <col:31> 'long' 8192
|-VarDecl 0x2c0144c0 <line:376:5, col:32> col:23 referenced xdigit 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c014508 <col:32> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c0144f0 <col:32> 'long' 65536
|-VarDecl 0x2c014560 <line:382:5, col:31> col:23 blank 'const mask':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x2c0145a8 <col:31> 'const mask':'const unsigned long' <IntegralCast>
|   `-IntegerLiteral 0x2c014590 <col:31> 'long' 131072
|-VarDecl 0x2c014600 <line:409:5, col:39> col:23 referenced alnum 'const mask':'const unsigned long' static cinit
| `-BinaryOperator 0x2c014680 <col:31, col:39> 'unsigned long' '|'
|   |-ImplicitCastExpr 0x2c014660 <col:31> 'mask':'unsigned long' <LValueToRValue>
|   | `-DeclRefExpr 0x2c014630 <col:31> 'const mask':'const unsigned long' lvalue Var 0x2c0142e0 'alpha' 'const mask':'const unsigned long'
|   `-ImplicitCastExpr 0x2c014670 <col:39> 'mask':'unsigned long' <LValueToRValue>
|     `-DeclRefExpr 0x2c014648 <col:39> 'const mask':'const unsigned long' lvalue Var 0x2c014380 'digit' 'const mask':'const unsigned long'
|-VarDecl 0x2c0146e0 <line:410:5, col:39> col:23 referenced graph 'const mask':'const unsigned long' static cinit
| `-BinaryOperator 0x2c014760 <col:31, col:39> 'unsigned long' '|'
|   |-ImplicitCastExpr 0x2c014740 <col:31> 'mask':'unsigned long' <LValueToRValue>
|   | `-DeclRefExpr 0x2c014710 <col:31> 'const mask':'const unsigned long' lvalue Var 0x2c014600 'alnum' 'const mask':'const unsigned long'
|   `-ImplicitCastExpr 0x2c014750 <col:39> 'mask':'unsigned long' <LValueToRValue>
|     `-DeclRefExpr 0x2c014728 <col:39> 'const mask':'const unsigned long' lvalue Var 0x2c014420 'punct' 'const mask':'const unsigned long'
|-CXXConstructorDecl 0x2c014820 <line:412:5, col:81> col:67 used ctype_base 'void (void)'
| |-CompoundStmt 0x2c0148d8 <col:80, col:81>
| |-AlwaysInlineAttr 0x2c014890 <col:47> always_inline
| `-VisibilityAttr 0x2c0148c0 <col:21, col:44> Hidden
|-CXXDestructorDecl 0x2c028630 <line:328:56> col:56 implicit ~ctype_base 'void (void) noexcept' inline
|-CXXConstructorDecl 0x2c0287a0 <col:56> col:56 implicit constexpr ctype_base 'void (const class std::__1::ctype_base &)' inline noexcept-unevaluated 0x2c0287a0
| `-ParmVarDecl 0x2c028850 <col:56> col:56 'const class std::__1::ctype_base &'
`-CXXConstructorDecl 0x2c0288b0 <col:56> col:56 implicit constexpr ctype_base 'void (class std::__1::ctype_base &&)' inline noexcept-unevaluated 0x2c0288b0
  `-ParmVarDecl 0x2c028960 <col:56> col:56 'class std::__1::ctype_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ctype_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::ctype_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
   0 | class std::__1::ctype<char>
   0 |   class std::__1::locale::facet (primary base)
   0 |     class std::__1::__shared_count (primary base)
   0 |       (__shared_count vtable pointer)
   4 |       long __shared_owners_
   0 |   class std::__1::ctype_base (base) (empty)
   8 |   const mask * __tab_
  12 |   _Bool __del_
     | [sizeof=16, dsize=13, align=4
     |  nvsize=13, nvalign=4]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x2c029780 </usr/include/c++/v1/__locale:519:1, line:638:1> line:520:56 class ctype definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::ctype_base'
|-TemplateArgument type 'char'
|-TypeVisibilityAttr 0x2c029840 <col:23, col:52> Default
|-CXXRecordDecl 0x2c0299c0 <col:1, col:56> col:56 implicit referenced class ctype
|-FieldDecl 0x2c029a40 <line:523:5, col:17> col:17 referenced __tab_ 'const mask *'
|-FieldDecl 0x2c029a80 <line:524:5, col:10> col:10 __del_ '_Bool'
|-AccessSpecDecl 0x2c029ab0 <line:525:1, col:7> col:1 public
|-TypedefDecl 0x2c029ad0 <line:526:5, col:18> col:18 referenced char_type 'char'
|-CXXConstructorDecl 0x2c029c70 <line:528:5, col:80> col:14 ctype 'void (const mask *, _Bool, size_t)'
| |-ParmVarDecl 0x2c029b10 <col:20, col:40> col:32 __tab 'const mask *' cinit
